{"word_to_stem":{},"stem_to_sid":{},"word_to_id":{"":0,"тестовичоктестовичоктестовичоктестовичоктестовичоктестовичоктестовичок":1,"основное":2,"кратко":3,"сложность":4,"алгоритма":5,"показывает":6,"как":7,"быстро":8,"растёт":9,"время":10,"выполнения":11,"или":12,"объём":13,"памяти":14,"при":15,"увеличении":16,"входных":17,"данных":18,"записывается":19,"o":20,"используется":21,"для":22,"оценки":23,"и":24,"сравнения":25,"производительности":26,"часто":27,"используемые":28,"классы":29,"сложности":30,"обозначение":31,"название":32,"пример":33,"комментарий":34,"1":35,"константная":36,"доступ":37,"по":38,"индексу":39,"array":40,"i":41,"не":42,"зависит":43,"от":44,"размера":45,"входа":46,"log":47,"n":48,"логарифмическая":49,"бинарный":50,"поиск":51,"в":52,"отсортированном":53,"массиве":54,"делим":55,"на":56,"2":57,"каждом":58,"шаге":59,"линейная":60,"перебор":61,"всех":62,"элементов":63,"каждое":64,"значение":65,"смотрится":66,"один":67,"раз":68,"линейно":69,"логарифм":70,"быстрая":71,"сортировка":72,"merge":73,"sort":74,"оптимум":75,"сортировки":76,"сравнениями":77,"n²":78,"квадратичная":79,"вложенные":80,"циклы":81,"сравнение":82,"со":83,"всеми":84,"деградирует":85,"росте":86,"2ⁿ":87,"экспоненциальная":88,"подмножеств":89,"комбинаторика":90,"практически":91,"без":92,"оптимизаций":93,"визуальное":94,"роста":95,"размер":96,"10":97,"3":98,"30":99,"100":100,"7":101,"700":102,"000":103,"1000":104,"млн":105,"собеседованиях":106,"спрашивают":107,"q1":108,"почему":109,"работает":110,"за":111,"делит":112,"массив":113,"пополам":114,"логарифмическое":115,"количество":116,"шагов":117,"q2":118,"можно":119,"ли":120,"улучшить":121,"сортировку":122,"быстрее":123,"чем":124,"нет":125,"алгоритмов":126,"основанных":127,"сравнениях":128,"это":129,"теоретический":130,"предел":131,"q3":132,"опасны":133,"ведут":134,"к":135,"выше":136,"критично":137,"больших":138,"объемах":139,"q4":140,"важно":141,"понимать":142,"unity":143,"чтобы":144,"делать":145,"например":146,"find":147,"update":148,"foreach":149,"каждый":150,"кадр":151,"может":152,"давать":153,"микролаги":154,"gc":155,"q5":156,"где":157,"поведение":158,"quadtree":159,"octree":160,"пространству":161,"отсортированных":162,"структурах":163,"события":164,"таймеры":165,"буферы":166,"место":167,"подробного":168,"разбора":169,"частые":170,"вопросы":171,"анимации":172,"уже":173,"готовы":174,"экспорт":175,"анимаций":176,"из":177,"spine":178,"https":179,"www":180,"youtube":181,"com":182,"watch":183,"v":184,"j0mgh4mvbgc":185,"harmony":186,"8fuyyg2ogi8":187,"создание":188,"animationcontroller":189,"создавать":190,"используя":191,"rigging":192,"cy789ni2qxi":193,"интеграция":194,"dxdzttk2nle":195,"бесплатный":196,"тестовый":197,"спайн":198,"assetstore":199,"packages":200,"3d":201,"animations":202,"free":203,"2d":204,"character":205,"animation":206,"177560":207,"content":208,"png":209,"сета":210,"hkaysu1z":211,"n8":212,"t":213,"849s":214,"какая":215,"проблема":216,"есть":217,"чего":218,"dependency":219,"injection":220,"стандартном":221,"scripting":222,"framework":223,"usf":224,"зависимости":225,"реализуются":226,"через":227,"ссылки":228,"сути":229,"реализация":230,"ecs":231,"components":232,"systems":233,"данные":234,"операции":235,"с":236,"ними":237,"monobehaviours":238,"а":239,"entity":240,"сущность":241,"id":242,"gameobjects":243,"том":244,"что":245,"дефолту":246,"такой":247,"схеме":248,"компонент":249,"знает":250,"о":251,"других":252,"сущностях":253,"компонентах":254,"т":255,"е":256,"своих":257,"зависимостях":258,"обеспечения":259,"связей":260,"приложении":261,"ioc":262,"container":263,"inversion":264,"of":265,"control":266,"объект":267,"который":268,"создает":269,"содержит":270,"которые":271,"должны":272,"внедрены":273,"объекты":274,"приложения":275,"такое":276,"di":277,"архитектура":278,"паттерн":279,"которой":280,"внедряет":281,"другого":282,"объекта":283,"зависимость":284,"нужен":285,"классу":286,"своего":287,"кода":288,"внедрение":289,"передача":290,"зависимому":291,"объекту":292,"обеспечивать":293,"свои":294,"выполнять":295,"другие":296,"такие":297,"предоставляет":298,"zenject":299,"injections":300,"constructor":301,"field":302,"method":303,"property":304,"зависимостей":305,"bindings":306,"привязка":307,"типа":308,"экземпляру":309,"installers":310,"предоставляют":311,"ios":312,"контейнеру":313,"все":314,"context":315,"связывание":316,"инсталлера":317,"контейнера":318,"также":319,"иногда":320,"проектах":321,"делают":322,"облегченные":323,"версии":324,"dicontainer":325,"которых":326,"компенсировать":327,"следующие":328,"минусы":329,"слишком":330,"частое":331,"использование":332,"system":333,"reflection":334,"runtime":335,"рекомендуется":336,"минимизировать":337,"дороговизны":338,"получение":339,"определенного":340,"проектного":341,"сцены":342,"этого":343,"тут":344,"же":345,"добавить":346,"ивенты":347,"разных":348,"контейнеров":349,"оптимизация":350,"внедрения":351,"monobehaviour":352,"вместо":353,"использования":354,"injectgameobject":355,"проходит":356,"всей":357,"иерархии":358,"доп":359,"интерфейсы":360,"огромен":361,"большинство":362,"функционала":363,"никогда":364,"пригождается":365,"geeksforgeeks":366,"org":367,"difference":368,"between":369,"mvc":370,"mvp":371,"and":372,"mvvm":373,"architecture":374,"pattern":375,"in":376,"android":377,"model":378,"view":379,"controller":380,"модель":381,"вид":382,"контроллер":383,"представляет":384,"реагирует":385,"команды":386,"контроллера":387,"изменяя":388,"свое":389,"состояние":390,"отвечает":391,"взаимодействие":392,"внешними":393,"данными":394,"отображение":395,"модели":396,"реагируя":397,"изменения":398,"интерпретирует":399,"действия":400,"пользователя":401,"оповещая":402,"необходимости":403,"изменений":404,"он":405,"обновляет":406,"только":407,"визуал":408,"логика":409,"ввод":410,"обновление":411,"связи":412,"менее":413,"изолированные":414,"хуже":415,"тестируемость":416,"ui":417,"presenter":418,"представление":419,"разница":420,"имеет":421,"прямой":422,"эту":423,"связь":424,"обеспечивает":425,"решает":426,"отображать":427,"контролируя":428,"обрабатывает":429,"обновляя":430,"между":431,"пассивна":432,"всё":433,"хорошо":434,"подходит":435,"unit":436,"тестов":437,"чёткая":438,"структура":439,"viewmodel":440,"похож":441,"отличие":442,"нужные":443,"представления":444,"отделены":445,"базовой":446,"core":447,"логики":448,"абстракция":449,"информирует":450,"действиях":451,"отображает":452,"той":453,"самостоятельной":454,"имеющие":455,"отношение":456,"представлению":457,"биндинги":458,"связаны":459,"binding":460,"удобно":461,"реактивностью":462,"data":463,"меньше":464,"ручной":465,"viper":466,"interactor":467,"бизнес":468,"связывает":469,"слои":470,"router":471,"навигация":472,"строго":473,"изолированы":474,"сложных":475,"многоэкранных":476,"сценариев":477,"легко":478,"масштабируется":479,"тестируется":480,"отличия":481,"про":482,"ничего":483,"всю":484,"логику":485,"держит":486,"изолирован":487,"вынесены":488,"отдельно":489,"жестко":490,"проблему":491,"связуещего":492,"звена":493,"реализуется":494,"событиями":495,"сочетается":496,"реактивным":497,"программированием":498,"делает":499,"более":500,"гибким":501,"отделение":502,"ко":503,"многим":504,"быть":505,"реализован":506,"разными":507,"одному":508,"одной":509,"применены":510,"разные":511,"input":512,"обрабатывается":513,"сложно":514,"тестировать":515,"тестирование":516,"осложняет":517,"жесткая":518,"легкое":519,"счет":520,"нежестких":521,"выбрали":522,"отделить":523,"кроме":524,"того":525,"применения":526,"разным":527,"были":528,"окна":529,"инпутом":530,"но":531,"одинаковыми":532,"входными":533,"выходными":534,"позволило":535,"сделать":536,"инструмент":537,"эдиторе":538,"тестирования":539,"solid":540,"акроним":541,"каждая":542,"буква":543,"5":544,"основных":545,"принципов":546,"ооп":547,"s":548,"single":549,"responsibility":550,"принцип":551,"единственной":552,"ответственности":553,"должен":554,"иметь":555,"какую":556,"то":557,"одну":558,"функциональность":559,"эта":560,"должна":561,"инкапсулирована":562,"класс":563,"oped":564,"closed":565,"открытости":566,"закрытости":567,"открыты":568,"расширения":569,"закрыты":570,"поведения":571,"l":572,"liskov":573,"substitution":574,"подстановки":575,"барбары":576,"лисков":577,"наследник":578,"дополняет":579,"заменяет":580,"базовый":581,"они":582,"могли":583,"бы":584,"использоваться":585,"родительских":586,"классов":587,"нарушая":588,"работу":589,"программы":590,"interface":591,"segregation":592,"разделения":593,"интерфейсов":594,"разделение":595,"так":596,"было":597,"неиспользуемых":598,"методов":599,"d":600,"принци":601,"инверсии":602,"модули":603,"верхних":604,"уровней":605,"зависеть":606,"модулей":607,"нижних":608,"абстракции":609,"конкретных":610,"деталей":611,"реализации":612,"тогда":613,"детали":614,"абстракций":615,"какие":616,"принципы":617,"лежат":618,"основе":619,"объектно":620,"ориентированного":621,"программирования":622,"полезны":623,"проблемы":624,"решают":625,"чём":626,"абстракцией":627,"инкапсуляцией":628,"наследованием":629,"полиморфизмом":630,"опирается":631,"четыре":632,"базовых":633,"принципа":634,"инкапсуляция":635,"наследование":636,"полиморфизм":637,"эти":638,"позволяют":639,"строить":640,"гибкие":641,"переиспользуемые":642,"расширяемые":643,"архитектуры":644,"помогают":645,"упростить":646,"сложные":647,"системы":648,"скрыть":649,"уменьшить":650,"связанность":651,"компонентов":652,"практике":653,"scriptableobject":654,"компоненты":655,"выделение":656,"существенных":657,"характеристик":658,"игнорирование":659,"несущественных":660,"weapon":661,"определять":662,"метод":663,"fire":664,"раскрывая":665,"конкретно":666,"стреляют":667,"виды":668,"оружия":669,"цель":670,"предоставив":671,"простой":672,"интерфейс":673,"c":674,"абстрактные":675,"abstract":676,"означает":677,"сокрытие":678,"внутреннего":679,"состояния":680,"управление":681,"доступом":682,"нему":683,"данным":684,"осуществляется":685,"публичные":686,"методы":687,"свойства":688,"поля":689,"private":690,"protected":691,"помощью":692,"модификаторов":693,"доступа":694,"public":695,"internal":696,"позволяет":697,"защитить":698,"некорректного":699,"описать":700,"отношения":701,"общими":702,"частными":703,"типами":704,"производный":705,"даёт":706,"возможность":707,"повторно":708,"использовать":709,"код":710,"расширять":711,"дублирования":712,"поддерживается":713,"одиночное":714,"class":715,"a":716,"b":717,"имитировать":718,"множественное":719,"объектам":720,"одинаковым":721,"интерфейсом":722,"вести":723,"себя":724,"разному":725,"возможно":726,"счёт":727,"переопределения":728,"override":729,"компилятор":730,"рантайм":731,"могут":732,"обрабатывать":733,"ссылку":734,"тип":735,"виртуальные":736,"делегаты":737,"каверзные":738,"скрывает":739,"простым":740,"ограничивает":741,"внутреннему":742,"состоянию":743,"реализовать":744,"наследования":745,"ienemy":746,"классами":747,"связанными":748,"запрещено":749,"избежать":750,"проблем":751,"ромбовидного":752,"конфликта":753,"альтернатива":754,"композицию":755,"отличается":756,"содержать":757,"реализацию":758,"сигнатуры":759,"до":760,"8":761,"0":762,"множественно":763,"абстрактный":764,"_что":765,"principle":766,"связан":767,"_":768,"подкласса":769,"корректно":770,"заменять":771,"базового":772,"класса":773,"нарушение":774,"приводит":775,"неожиданному":776,"поведению":777,"использовании":778,"интерфейса":779,"архитектурного":780,"решения":781,"опишите":782,"вы":783,"спроектировали":784,"архитектуру":785,"какого":786,"либо":787,"игрового":788,"модуля":789,"структурировать":790,"систему":791,"управления":792,"игровыми":793,"уровнями":794,"инвентаря":795,"мобильной":796,"игре":797,"здесь":798,"оценивается":799,"умение":800,"разбивать":801,"выделять":802,"применять":803,"паттерны":804,"проектирования":805,"организации":806,"todo":807,"краткая":808,"обобщающая":809,"информация":810,"теме":811,"ответ":812,"вопрос":813,"строки":814,"глубокого":815,"понимания":816,"вопроса":817,"обычно":818,"задают":819,"звездочкой":820,"kiss":821,"keep":822,"it":823,"simple":824,"stupid":825,"усложнять":826,"писать":827,"просто":828,"надежно":829,"небольшие":830,"решающие":831,"лишнего":832,"dry":833,"don":834,"repeat":835,"yourself":836,"избегать":837,"переиспользовать":838,"yagni":839,"you":840,"are":841,"not":842,"gonna":843,"need":844,"реализовывать":845,"нужно":846,"сейчас":847,"ваши":848,"небольшими":849,"40":850,"50":851,"строк":852,"модификации":853,"будущем":854,"должно":855,"возникнуть":856,"трудностей":857,"4":858,"система":859,"лучше":860,"всего":861,"если":862,"она":863,"усложняется":864,"надобности":865,"устанавливайте":866,"целую":867,"библиотеку":868,"ради":869,"функции":870,"неё":871,"6":872,"делай":873,"просят":874,"необходимо":875,"дубово":876,"избегайте":877,"копирования":878,"выносите":879,"общую":880,"прежде":881,"добавлять":882,"функционал":883,"проверьте":884,"проекте":885,"создан":886,"константы":887,"реализуйте":888,"теории":889,"оно":890,"пригодится":891,"подчищайте":892,"ненужный":893,"найдите":894,"git":895,"историю":896,"программист":897,"новый":898,"котором":899,"его":900,"благими":901,"намерениями":902,"должной":903,"проверки":904,"добавите":905,"багов":906,"шаблоны":907,"gof":908,"grasp":909,"game":910,"programming":911,"patterns":912,"зачем":913,"нужны":914,"применяются":915,"шаблонов":916,"чаще":917,"игровой":918,"разработке":919,"различия":920,"паттернами":921,"знать":922,"наизусть":923,"важнее":924,"уметь":925,"проверенные":926,"временем":927,"типовых":928,"архитектурных":929,"задач":930,"gang":931,"four":932,"классические":933,"23":934,"штуки":935,"разделенные":936,"категории":937,"порождающие":938,"структурные":939,"поведенческие":940,"general":941,"assignment":942,"software":943,"распределения":944,"адаптация":945,"паттернов":946,"под":947,"задачи":948,"геймдева":949,"используют":950,"комбинации":951,"этих":952,"подходов":953,"адаптируя":954,"особенности":955,"движка":956,"монобехи":957,"сериализация":958,"классических":959,"шаблона":960,"сформулированных":961,"книге":962,"_design":963,"elements":964,"reusable":965,"object":966,"oriented":967,"software_":968,"разделяются":969,"категория":970,"примеры":971,"singleton":972,"factory":973,"builder":974,"adapter":975,"composite":976,"decorator":977,"state":978,"observer":979,"command":980,"strategy":981,"идея":982,"снизить":983,"гибкой":984,"суть":985,"information":986,"expert":987,"ответственность":988,"у":989,"кто":990,"creator":991,"создаёт":992,"им":993,"владеет":994,"использует":995,"принимает":996,"пользовательский":997,"управляет":998,"логикой":999,"low":1000,"coupling":1001,"слабо":1002,"high":1003,"cohesion":1004,"polymorphism":1005,"делегирование":1006,"variations":1007,"закрыть":1008,"интерфейсами":1009,"абстракциями":1010,"основа":1011,"здравого":1012,"применяется":1013,"интуитивно":1014,"особенно":1015,"robert":1016,"nystrom":1017,"практичные":1018,"адаптированные":1019,"real":1020,"time":1021,"ограничение":1022,"движков":1023,"component":1024,"loop":1025,"jobsystem":1026,"event":1027,"queue":1028,"внутренние":1029,"decoupled":1030,"вызовы":1031,"ai":1032,"игровые":1033,"undo":1034,"buffer":1035,"репликация":1036,"service":1037,"locator":1038,"замена":1039,"audiomanager":1040,"instance":1041,"play":1042,"dirty":1043,"flag":1044,"пересчётов":1045,"флаг":1046,"изменении":1047,"подходы":1048,"конструкторы":1049,"сервисная":1050,"iuiservice":1051,"igamestateservice":1052,"ключевые":1053,"геймплейной":1054,"чистых":1055,"модулях":1056,"их":1057,"применить":1058,"выбор":1059,"переключение":1060,"состояний":1061,"объединяются":1062,"стратегия":1063,"напрямую":1064,"ограничений":1065,"проще":1066,"неявными":1067,"зло":1068,"нарушает":1069,"явность":1070,"плохо":1071,"усложняет":1072,"жизненным":1073,"циклом":1074,"сервис":1075,"локаторы":1076,"объектов":1077,"даже":1078,"принципу":1079,"д":1080,"_какой":1081,"сетевого":1082,"универсален":1083,"отложенного":1084,"отмены":1085,"реплеев":1086,"синхронизации":1087,"действий":1088,"организовать":1089,"ci":1090,"cd":1091,"проекта":1092,"инструменты":1093,"наиболее":1094,"популярны":1095,"cloud":1096,"build":1097,"jenkins":1098,"github":1099,"actions":1100,"автоматизировать":1101,"сборки":1102,"юнитетсы":1103,"выкладку":1104,"билдов":1105,"автоматизирует":1106,"процессы":1107,"качества":1108,"выкладки":1109,"коробки":1110,"гибкость":1111,"gitlab":1112,"bitrise":1113,"инфраструктуры":1114,"уровня":1115,"кастомизации":1116,"бюджета":1117,"требуемой":1118,"прозрачности":1119,"автоматизируются":1120,"юнит":1121,"тесты":1122,"артефактов":1123,"деплой":1124,"testflight":1125,"google":1126,"s3":1127,"discord":1128,"облачный":1129,"встраивается":1130,"dashboard":1131,"простая":1132,"настройка":1133,"подключение":1134,"репозитория":1135,"целевой":1136,"платформы":1137,"автоматический":1138,"триггер":1139,"коммитов":1140,"поддерживает":1141,"multiple":1142,"targets":1143,"webgl":1144,"version":1145,"scm":1146,"credentials":1147,"automation":1148,"with":1149,"post":1150,"pre":1151,"export":1152,"methods":1153,"платный":1154,"большом":1155,"объеме":1156,"ограничена":1157,"скриптуемости":1158,"полной":1159,"shell":1160,"доступности":1161,"неудобно":1162,"кастомных":1163,"пайплайнов":1164,"кроссплатформенный":1165,"сервер":1166,"кастомизацией":1167,"продвинутых":1168,"командах":1169,"контроль":1170,"инфраструктурой":1171,"основные":1172,"элементы":1173,"jenkinsfile":1174,"freestyle":1175,"job":1176,"cli":1177,"batchmode":1178,"nographics":1179,"executemethod":1180,"шаги":1181,"checkout":1182,"compile":1183,"run":1184,"tests":1185,"upload":1186,"установленный":1187,"editor":1188,"docker":1189,"контейнер":1190,"hub":1191,"activation":1192,"интегрируют":1193,"fastlane":1194,"artifactory":1195,"slack":1196,"нативный":1197,"лимита":1198,"удобной":1199,"yaml":1200,"конфигурацией":1201,"хорошей":1202,"интеграцией":1203,"pull":1204,"requests":1205,"issues":1206,"releases":1207,"образ":1208,"runner":1209,"поддерживаются":1210,"секреты":1211,"кэширование":1212,"library":1213,"автоматического":1214,"билда":1215,"apk":1216,"aab":1217,"zip":1218,"настроить":1219,"пуш":1220,"itch":1221,"io":1222,"firebase":1223,"hosting":1224,"практические":1225,"советы":1226,"хардкодьте":1227,"параметры":1228,"platform":1229,"path":1230,"defines":1231,"buildconfig":1232,"используйте":1233,"отдельный":1234,"script":1235,"buildpipeline":1236,"buildplayer":1237,"ядро":1238,"храните":1239,"версию":1240,"одном":1241,"месте":1242,"cs":1243,"json":1244,"projectsettings":1245,"asset":1246,"отделяйте":1247,"скрипты":1248,"подключите":1249,"статический":1250,"анализ":1251,"всегда":1252,"сохраняйте":1253,"артефакты":1254,"кэш":1255,"xcode":1256,"требует":1257,"подписания":1258,"когда":1259,"какой":1260,"выбирать":1261,"устроен":1262,"вызвать":1263,"командной":1264,"кешировать":1265,"_как":1266,"управлять":1267,"сборочными":1268,"конфигурациями":1269,"prod":1270,"dev":1271,"debug":1272,"flow":1273,"отличаются":1274,"ветвления":1275,"trunk":1276,"based":1277,"ту":1278,"иную":1279,"стратегию":1280,"соглашения":1281,"веткам":1282,"коммитам":1283,"приняты":1284,"команде":1285,"распределённая":1286,"контроля":1287,"версий":1288,"позволяющая":1289,"каждому":1290,"участнику":1291,"полную":1292,"копию":1293,"одна":1294,"стратегий":1295,"структурирующая":1296,"над":1297,"фичами":1298,"релизами":1299,"хотфиксами":1300,"команд":1301,"предсказуемым":1302,"релизов":1303,"избыточной":1304,"fast":1305,"paced":1306,"альтернативные":1307,"выбираются":1308,"скорости":1309,"процесса":1310,"qa":1311,"основы":1312,"работы":1313,"dvcs":1314,"distributed":1315,"коммиты":1316,"ветки":1317,"мержи":1318,"происходят":1319,"локально":1320,"лишь":1321,"push":1322,"синхронизируются":1323,"удалённым":1324,"репозиторием":1325,"snapshot":1326,"коммит":1327,"ссылка":1328,"снимок":1329,"метаданные":1330,"автор":1331,"сообщение":1332,"родительский":1333,"мощную":1334,"поддержку":1335,"слияния":1336,"обеспечивая":1337,"быстрое":1338,"ветками":1339,"switch":1340,"независимую":1341,"разработку":1342,"feature":1343,"ветках":1344,"безопасные":1345,"эксперименты":1346,"stash":1347,"reflog":1348,"cherry":1349,"pick":1350,"rebase":1351,"лёгкое":1352,"восстановление":1353,"удалённых":1354,"стратегии":1355,"vincent":1356,"driessen":1357,"ориентирована":1358,"релизный":1359,"цикл":1360,"main":1361,"стабильная":1362,"прод":1363,"версия":1364,"релизы":1365,"develop":1366,"интеграционная":1367,"ветка":1368,"фичи":1369,"мержатся":1370,"сюда":1371,"новые":1372,"мерж":1373,"release":1374,"подготовка":1375,"релизу":1376,"hotfix":1377,"экстренные":1378,"фиксы":1379,"преимущества":1380,"чёткое":1381,"удобство":1382,"предсказуемые":1383,"недостатки":1384,"много":1385,"веток":1386,"сложнее":1387,"визуально":1388,"мержить":1389,"continuous":1390,"deployment":1391,"development":1392,"основная":1393,"используются":1394,"короткоживущие":1395,"branches":1396,"flags":1397,"плюсы":1398,"упрощённая":1399,"максимальная":1400,"совместимость":1401,"доставка":1402,"фич":1403,"высокой":1404,"дисциплины":1405,"покрытия":1406,"тестами":1407,"потенциально":1408,"больше":1409,"конфликтов":1410,"параллельной":1411,"работе":1412,"упрощённые":1413,"вариации":1414,"master":1415,"делаются":1416,"отдельных":1417,"проходят":1418,"request":1419,"затем":1420,"вливаются":1421,"production":1422,"staging":1423,"окружений":1424,"практика":1425,"проектов":1426,"артефактами":1427,"билды":1428,"meta":1429,"игнорировать":1430,"сгенерированные":1431,"файлы":1432,"gitignore":1433,"temp":1434,"п":1435,"хранить":1436,"обязательны":1437,"guid":1438,"ссылок":1439,"сценах":1440,"ассетах":1441,"конфликты":1442,"prefab":1443,"стоит":1444,"настраивать":1445,"smart":1446,"lock":1447,"plastic":1448,"командные":1449,"префиксы":1450,"bugfix":1451,"названия":1452,"player":1453,"movement":1454,"crash":1455,"сообщения":1456,"feat":1457,"добавлено":1458,"движение":1459,"fix":1460,"исправлен":1461,"баг":1462,"мержей":1463,"commit":1464,"триггеры":1465,"билд":1466,"сохраняет":1467,"объединения":1468,"переписывает":1469,"делая":1470,"её":1471,"линейной":1472,"опасен":1473,"публичных":1474,"чистки":1475,"истории":1476,"перед":1477,"неэффективен":1478,"изоляция":1479,"стабильность":1480,"избыточная":1481,"замедление":1482,"интеграции":1483,"использовали":1484,"частого":1485,"мёрджа":1486,"убирает":1487,"необходимость":1488,"идеален":1489,"высоким":1490,"уровнем":1491,"автоматизации":1492,"squash":1493,"объединяет":1494,"сжатия":1495,"вливанием":1496,"сохранить":1497,"чистоту":1498,"файлах":1499,"lfs":1500,"tool":1501,"редактирование":1502,"сцен":1503,"коммуникацию":1504,"блокировки":1505,"liveops":1506,"ab":1507,"внутриигровые":1508,"предложения":1509,"сервисов":1510,"remote":1511,"config":1512,"gametune":1513,"gameanalytics":1514,"applovin":1515,"max":1516,"sdk":1517,"myunity":1518,"d1":1519,"81":1520,"82":1521,"80":1522,"83":1523,"d0":1524,"ba":1525,"8b":1526,"b4":1527,"b0":1528,"bd":1529,"85":1530,"набор":1531,"значений":1532,"массива":1533,"идентифицируемых":1534,"стек":1535,"stack":1536,"список":1537,"организованных":1538,"lifo":1539,"last":1540,"first":1541,"out":1542,"последний":1543,"пришел":1544,"первый":1545,"вышел":1546,"столбик":1547,"стопка":1548,"отложенные":1549,"пользователь":1550,"тапает":1551,"персонажу":1552,"тот":1553,"занят":1554,"освободится":1555,"нам":1556,"важна":1557,"последнем":1558,"самом":1559,"актуальном":1560,"тапе":1561,"добавление":1562,"вершину":1563,"pop":1564,"извлечение":1565,"элемента":1566,"вершины":1567,"peek":1568,"возвращение":1569,"очередь":1570,"fifo":1571,"конец":1572,"удаление":1573,"начала":1574,"enqueue":1575,"dequeue":1576,"связный":1577,"связанных":1578,"узлов":1579,"хранятся":1580,"следующий":1581,"элемент":1582,"двусвязный":1583,"связанный":1584,"хранится":1585,"предыдущий":1586,"непрерывный":1587,"участок":1588,"фиксированной":1589,"длиной":1590,"неудобен":1591,"управлении":1592,"list":1593,"обёртка":1594,"массивом":1595,"динамической":1596,"аллокацией":1597,"эффективен":1598,"постепенном":1599,"dictionary":1600,"tkey":1601,"tvalue":1602,"хеш":1603,"таблица":1604,"bucket":1605,"списками":1606,"ячейками":1607,"оптимален":1608,"быстрых":1609,"lookups":1610,"память":1611,"операция":1612,"блок":1613,"header":1614,"length":1615,"внутренний":1616,"capacity":1617,"count":1618,"buckets":1619,"entries":1620,"key":1621,"value":1622,"hashcode":1623,"next":1624,"расположение":1625,"куче":1626,"struct":1627,"подряд":1628,"внутри":1629,"раскиданы":1630,"разбросаны":1631,"фрагментацией":1632,"адрес":1633,"base":1634,"sizeof":1635,"неприменимо":1636,"индексов":1637,"ключу":1638,"установка":1639,"прямая":1640,"запись":1641,"ячейку":1642,"во":1643,"dict":1644,"значению":1645,"линейный":1646,"values":1647,"keys":1648,"перебором":1649,"среднем":1650,"коллизиях":1651,"вставка":1652,"невозможна":1653,"требуется":1654,"создать":1655,"амортизированно":1656,"соответствующий":1657,"сдвиг":1658,"после":1659,"удалённого":1660,"remove":1661,"вызывает":1662,"известен":1663,"иначе":1664,"итерация":1665,"максимально":1666,"идут":1667,"чуть":1668,"медленнее":1669,"структуры":1670,"включать":1671,"пустые":1672,"удалённые":1673,"ячейки":1674,"реаллокация":1675,"вручную":1676,"new":1677,"автоматически":1678,"превышении":1679,"resize":1680,"происходит":1681,"loadfactor":1682,"полного":1683,"перестроения":1684,"базовая":1685,"коллекция":1686,"net":1687,"представляющая":1688,"длины":1689,"непрерывной":1690,"памятью":1691,"производительных":1692,"операций":1693,"заранее":1694,"изменяется":1695,"внутреннее":1696,"устройство":1697,"располагаются":1698,"пропусков":1699,"называется":1700,"структурой":1701,"служебный":1702,"заголовок":1703,"длина":1704,"сами":1705,"последовательно":1706,"разрывов":1707,"отличная":1708,"локальность":1709,"рядом":1710,"логике":1711,"находятся":1712,"обращении":1713,"процессор":1714,"загрузит":1715,"остальные":1716,"подлежит":1717,"изменению":1718,"доступе":1719,"загружает":1720,"соседние":1721,"итерации":1722,"векторные":1723,"вычисления":1724,"быстрыми":1725,"фиксирован":1726,"создании":1727,"нельзя":1728,"изменить":1729,"работают":1730,"вычисляется":1731,"хранения":1732,"структур":1733,"vector3":1734,"float":1735,"int":1736,"максимальную":1737,"плотность":1738,"производительность":1739,"динамический":1740,"поверх":1741,"универсальная":1742,"реализующая":1743,"обёртку":1744,"автоматическим":1745,"управлением":1746,"размером":1747,"предназначен":1748,"упорядоченных":1749,"возможностью":1750,"добавления":1751,"удаления":1752,"_items":1753,"хранилище":1754,"_size":1755,"реально":1756,"добавленных":1757,"выделенного":1758,"вместить":1759,"аллокации":1760,"ступ":1761,"вызова":1762,"clear":1763,"остаётся":1764,"деаллокации":1765,"повторного":1766,"использовани":1767,"empty":1768,"add":1769,"первую":1770,"аллокацию":1771,"переполнении":1772,"копированием":1773,"удвоенного":1774,"16":1775,"32":1776,"середине":1777,"сдвигом":1778,"известно":1779,"ожидаемое":1780,"сразу":1781,"указать":1782,"var":1783,"foo":1784,"избежит":1785,"каскада":1786,"аллокаций":1787,"копирований":1788,"списка":1789,"сбрасывает":1790,"освобождает":1791,"новых":1792,"trimexcess":1793,"уменьшает":1794,"пар":1795,"ключ":1796,"реализованная":1797,"массивами":1798,"оптимальна":1799,"быстрого":1800,"поиска":1801,"вставки":1802,"количестве":1803,"пропускается":1804,"функцию":1805,"получается":1806,"целое":1807,"число":1808,"которому":1809,"определяется":1810,"ячейка":1811,"лежать":1812,"функция":1813,"gethashcode":1814,"определённый":1815,"ключа":1816,"два":1817,"получить":1818,"коллизия":1819,"цепочка":1820,"индексы":1821,"entry":1822,"потому":1823,"достижении":1824,"создаётся":1825,"копируются":1826,"медленным":1827,"порядке":1828,"совпадающем":1829,"дыры":1830,"удалений":1831,"занимает":1832,"дополнительные":1833,"чтения":1834,"cpu":1835,"эффективно":1836,"предсказывать":1837,"кэшировать":1838,"адреса":1839,"высокая":1840,"readonly":1841,"equals":1842,"vector3int":1843,"boxing":1844,"процесс":1845,"преобразования":1846,"значимого":1847,"значения":1848,"type":1849,"ссылочный":1850,"unboxing":1851,"обратное":1852,"преобразование":1853,"обратно":1854,"потенциальное":1855,"падение":1856,"вызываемых":1857,"методах":1858,"ongui":1859,"приводится":1860,"интерфейсу":1861,"реализует":1862,"boxed":1863,"кладётся":1864,"кучу":1865,"heap":1866,"обёрнутую":1867,"оригинальное":1868,"стеке":1869,"явного":1870,"приведения":1871,"копирует":1872,"неверен":1873,"будет":1874,"invalidcastexception":1875,"возникает":1876,"незаметно":1877,"передаче":1878,"принимающий":1879,"tostring":1880,"логировании":1881,"pos":1882,"myvector3":1883,"добавлении":1884,"ienumerable":1885,"imyinterface":1886,"my":1887,"mystruct":1888,"аллоцируемая":1889,"созданию":1890,"нового":1891,"мусор":1892,"убирать":1893,"статтеры":1894,"лаги":1895,"фризы":1896,"мобилках":1897,"незаметным":1898,"повторяться":1899,"каждую":1900,"frame":1901,"скрытые":1902,"утечки":1903,"toolkit":1904,"кэширования":1905,"десятки":1906,"секунду":1907,"обобщения":1908,"generics":1909,"вызывают":1910,"csharp":1911,"copyedit":1912,"void":1913,"valuetype":1914,"перфрейм":1915,"коде":1916,"возможности":1917,"специальные":1918,"адаптеры":1919,"прочее":1920,"вызывать":1921,"выделить":1922,"адаптер":1923,"generic":1924,"избегают":1925,"генерирует":1926,"метода":1927,"узнать":1928,"смотри":1929,"il":1930,"используй":1931,"профайлер":1932,"profiler":1933,"jetbrains":1934,"dottrace":1935,"отследить":1936,"spikes":1937,"unbox":1938,"ить":1939,"неверный":1940,"underlying":1941,"был":1942,"совместим":1943,"q6":1944,"точно":1945,"приведение":1946,"params":1947,"вызов":1948,"виртуальных":1949,"стандарт":1950,"построена":1951,"платформа":1952,"clr":1953,"microsoft":1954,"компилируется":1955,"промежуточный":1956,"язык":1957,"запуска":1958,"преобразуется":1959,"jit":1960,"компилятором":1961,"машинный":1962,"среды":1963,"common":1964,"language":1965,"infrastructure":1966,"спецификация":1967,"ecma":1968,"iso":1969,"описывающая":1970,"работать":1971,"включает":1972,"типовую":1973,"исполнения":1974,"безопасность":1975,"p":1976,"invoke":1977,"переносимые":1978,"исполняемые":1979,"mono":1980,"конкретная":1981,"выполнением":1982,"программ":1983,"компиляция":1984,"сборка":1985,"мусора":1986,"межъязыковая":1987,"запускает":1988,"intermediate":1989,"cil":1990,"байткод":1991,"языки":1992,"независим":1993,"скомпилирован":1994,"любую":1995,"just":1996,"берет":1997,"компилирует":1998,"конкретную":1999,"платформу":2000,"x64":2001,"учитывать":2002,"задержки":2003,"первом":2004,"вызове":2005,"включающая":2006,"библиотеки":2007,"bcl":2008,"компиляторы":2009,"roslyn":2010,"бывает":2011,"устарел":2012,"современное":2013,"компилировать":2014,"переносимый":2015,"формат":2016,"одинаково":2017,"понятный":2018,"платформ":2019,"облегчает":2020,"кроссплатформенность":2021,"преобразует":2022,"оптимизировать":2023,"обычный":2024,"il2cpp":2025,"проекты":2026,"компилируются":2027,"aot":2028,"запрещён":2029,"заменить":2030,"да":2031,"coreclr":2032,"ты":2033,"можешь":2034,"написать":2035,"свою":2036,"делегат":2037,"представляющий":2038,"определённой":2039,"сигнатурой":2040,"action":2041,"func":2042,"обобщённые":2043,"типы":2044,"делегатов":2045,"возвращает":2046,"активно":2047,"колбэков":2048,"событий":2049,"асинхронных":2050,"загрузки":2051,"пр":2052,"чётко":2053,"сигнатуру":2054,"делегата":2055,"область":2056,"отписки":2057,"способный":2058,"соответствует":2059,"сигнатуре":2060,"аргументы":2061,"возвращаемое":2062,"delegate":2063,"damagehandler":2064,"amount":2065,"объявление":2066,"takedamage":2067,"dmg":2068,"hp":2069,"handler":2070,"мультикаст":2071,"объединять":2072,"будут":2073,"вызываться":2074,"очереди":2075,"return":2076,"сохраняется":2077,"результат":2078,"последнего":2079,"вызванного":2080,"наличии":2081,"точной":2082,"аргумент":2083,"t1":2084,"t2":2085,"параметров":2086,"tresult":2087,"сначала":2088,"конце":2089,"повсеместно":2090,"button":2091,"onclick":2092,"addlistener":2093,"unityaction":2094,"multicastdelegate":2095,"dotween":2096,"oncomplete":2097,"onkill":2098,"onstepcomplete":2099,"tweencallback":2100,"ondamagetaken":2101,"custom":2102,"callbacks":2103,"dosomething":2104,"ondone":2105,"ссылочные":2106,"переменных":2107,"передавать":2108,"сравнивать":2109,"null":2110,"nullreferenceexception":2111,"проверяй":2112,"альтернативу":2113,"лямбде":2114,"garbage":2115,"collected":2116,"сам":2117,"держишь":2118,"них":2119,"мультикасте":2120,"возвращается":2121,"обработчика":2122,"vs":2123,"переменная":2124,"присвоить":2125,"очистить":2126,"возможен":2127,"изнутри":2128,"механизм":2129,"сигнал":2130,"событии":2131,"сигналов":2132,"onsomething":2133,"подписки":2134,"инвертированного":2135,"doafterdelay":2136,"callback":2137,"запрещающее":2138,"внешнее":2139,"присваивание":2140,"подписчиков":2141,"проверять":2142,"отписать":2143,"лямбду":2144,"лямбда":2145,"анонимная":2146,"неотписываема":2147,"несколько":2148,"игнорируются":2149,"порядку":2150,"отличный":2151,"плагиноподобных":2152,"систем":2153,"преимущество":2154,"обычным":2155,"методом":2156,"передать":2157,"повышает":2158,"модульность":2159,"enum":2160,"битовые":2161,"маски":2162,"применяют":2163,"обычного":2164,"подводные":2165,"камни":2166,"способ":2167,"именованные":2168,"представляющие":2169,"одного":2170,"сочетании":2171,"атрибутом":2172,"битовая":2173,"маска":2174,"позволяя":2175,"комбинировать":2176,"множество":2177,"флагов":2178,"переменной":2179,"побитовые":2180,"одновременно":2181,"системах":2182,"доступов":2183,"layermask":2184,"movementtype":2185,"walk":2186,"jump":2187,"капотом":2188,"целочисленные":2189,"фиксированного":2190,"набора":2191,"movementflags":2192,"none":2193,"0001":2194,"0010":2195,"0100":2196,"fly":2197,"перечисления":2198,"представляют":2199,"биты":2200,"combined":2201,"0101":2202,"проверка":2203,"наличия":2204,"флага":2205,"if":2206,"именно":2207,"степени":2208,"двойки":2209,"двоичном":2210,"представлении":2211,"уникальным":2212,"битом":2213,"произойдут":2214,"невозможно":2215,"понять":2216,"там":2217,"атрибут":2218,"влияет":2219,"добавляет":2220,"удобное":2221,"строковое":2222,"console":2223,"writeline":2224,"9":2225,"битовых":2226,"масок":2227,"компактность":2228,"штук":2229,"long":2230,"64":2231,"hideflags":2232,"eventmodifiers":2233,"кастомные":2234,"системные":2235,"флаги":2236,"неиспользуемые":2237,"которого":2238,"вернёт":2239,"combinedvalue":2240,"еще":2241,"явно":2242,"задавать":2243,"пустого":2244,"масштабируются":2245,"динамически":2246,"рантайме":2247,"сериализует":2248,"выглядят":2249,"сериализовать":2250,"удобным":2251,"инспекторе":2252,"кастомный":2253,"propertydrawer":2254,"odin":2255,"битовый":2256,"mask":2257,"layerindex":2258,"произойдет":2259,"задать":2260,"флагам":2261,"забыть":2262,"автоприсвоены":2263,"побитовая":2264,"сломается":2265,"начнут":2266,"конфликтовать":2267,"debuggerdisplay":2268,"нечитабельны":2269,"обязателен":2270,"желателен":2271,"проверяет":2272,"точное":2273,"совпадение":2274,"битов":2275,"установлен":2276,"false":2277,"флагом":2278,"флагами":2279,"умолчанию":2280,"свой":2281,"битовыми":2282,"чекбоксами":2283,"аналогами":2284,"языках":2285,"встречается":2286,"многих":2287,"включая":2288,"rust":2289,"swift":2290,"наличие":2291,"аналогов":2292,"конкретного":2293,"языка":2294,"сборщик":2295,"значимые":2296,"очищаются":2297,"размещаются":2298,"удаляются":2299,"поколениям":2300,"gen":2301,"запускается":2302,"мере":2303,"нехватке":2304,"приостанавливать":2305,"выполнение":2306,"потока":2307,"pause":2308,"встроенный":2309,"виртуальной":2310,"машины":2311,"отвечающий":2312,"автоматическое":2313,"сборках":2314,"backend":2315,"boehm":2316,"сгенерированный":2317,"контексте":2318,"признак":2319,"значимый":2320,"очистка":2321,"выходе":2322,"области":2323,"видимости":2324,"выделения":2325,"аллокация":2326,"reference":2327,"types":2328,"момент":2329,"строит":2330,"граф":2331,"достижимости":2332,"корневых":2333,"статические":2334,"регистры":2335,"помечает":2336,"дотянуться":2337,"считаются":2338,"мусором":2339,"удалены":2340,"фаз":2341,"mark":2342,"находит":2343,"достижимые":2344,"sweep":2345,"удаляет":2346,"мусорные":2347,"compact":2348,"перемещает":2349,"выжившие":2350,"устранить":2351,"фрагментацию":2352,"поколения":2353,"разделяет":2354,"поколение":2355,"описание":2356,"частая":2357,"пережившие":2358,"промежуточная":2359,"зона":2360,"долго":2361,"живущие":2362,"редкая":2363,"тяжёлая":2364,"loh":2365,"large":2366,"кб":2367,"перемещаются":2368,"чистятся":2369,"выживший":2370,"продвигается":2371,"тем":2372,"реже":2373,"срабатывает":2374,"определённым":2375,"условиям":2376,"хватает":2377,"свободной":2378,"превысило":2379,"лимит":2380,"allocation":2381,"budget":2382,"выросло":2383,"прямом":2384,"collect":2385,"остановка":2386,"визуальные":2387,"сборку":2388,"следует":2389,"крайней":2390,"паузу":2391,"блокировку":2392,"адаптивного":2393,"финализаторами":2394,"tools":2395,"бенчмарков":2396,"точек":2397,"явной":2398,"очистки":2399,"финализаторы":2400,"idisposable":2401,"подход":2402,"финализатор":2403,"classname":2404,"вызывается":2405,"удалением":2406,"увеличивает":2407,"нагрузку":2408,"отложенное":2409,"dispose":2410,"using":2411,"контролируемый":2412,"быстрый":2413,"финализации":2414,"освобождения":2415,"неуправляемых":2416,"ресурсов":2417,"потоки":2418,"хендлы":2419,"практики":2420,"полезно":2421,"избегает":2422,"частых":2423,"кадре":2424,"снижает":2425,"частоту":2426,"pool":2427,"готовые":2428,"destroy":2429,"очищает":2430,"новой":2431,"string":2432,"лишние":2433,"временные":2434,"упаковки":2435,"финализатора":2436,"освобождение":2437,"задержек":2438,"профайлеры":2439,"находить":2440,"устранять":2441,"избыточные":2442,"скрытых":2443,"enumerator":2444,"лямбды":2445,"замыкания":2446,"создают":2447,"выделением":2448,"полезные":2449,"вкладка":2450,"alloc":2451,"кадровые":2452,"memory":2453,"retained":2454,"objects":2455,"дерево":2456,"дубликаты":2457,"gettotalmemory":2458,"текущий":2459,"выделенной":2460,"объектом":2461,"выходит":2462,"пока":2463,"него":2464,"удалён":2465,"сборщиком":2466,"идёт":2467,"упаковывается":2468,"финализаторов":2469,"вызываются":2470,"задержкой":2471,"блокируют":2472,"увеличивают":2473,"произойдёт":2474,"приведении":2475,"упакуется":2476,"выделенный":2477,"мешает":2478,"внутренней":2479,"редко":2480,"выигрыш":2481,"q7":2482,"выживает":2483,"нескольких":2484,"проходов":2485,"считается":2486,"долгоживущим":2487,"переносится":2488,"следующее":2489,"описывает":2490,"контракт":2491,"допускает":2492,"множественную":2493,"определяет":2494,"свойств":2495,"индексаторов":2496,"возможна":2497,"default":2498,"полей":2499,"описания":2500,"независимо":2501,"члены":2502,"реализованные":2503,"наследуется":2504,"общей":2505,"частичной":2506,"обобщённого":2507,"наследовать":2508,"этом":2509,"attack":2510,"ireloadable":2511,"reload":2512,"gun":2513,"требований":2514,"структуре":2515,"индексаторы":2516,"реализующий":2517,"абстрактным":2518,"классом":2519,"неоднозначностей":2520,"множественным":2521,"методами":2522,"явная":2523,"ifoo":2524,"do":2525,"ibar":2526,"конфликтуют":2527,"предоставить":2528,"базовую":2529,"выдаст":2530,"ошибку":2531,"объявлен":2532,"базовом":2533,"классе":2534,"hashset":2535,"linkedlist":2536,"устроены":2537,"коллекции":2538,"реализуют":2539,"обычные":2540,"совместимы":2541,"burst":2542,"характеру":2543,"уникальности":2544,"уникальность":2545,"совместима":2546,"jobs":2547,"кольцевой":2548,"буфер":2549,"конца":2550,"узлу":2551,"извлекает":2552,"очередей":2553,"пула":2554,"q":2555,"item":2556,"простых":2557,"реальном":2558,"времени":2559,"кольцевые":2560,"nativequeue":2561,"кладёт":2562,"сверху":2563,"снимает":2564,"верхний":2565,"алгоритмах":2566,"обхода":2567,"dfs":2568,"откатов":2569,"second":2570,"val":2571,"полезен":2572,"back":2573,"меню":2574,"внимания":2575,"аллокациям":2576,"linkedlistnode":2577,"списков":2578,"частыми":2579,"удалениями":2580,"вставками":2581,"ссылке":2582,"node":2583,"addlast":2584,"addafter":2585,"15":2586,"точки":2587,"зрения":2588,"кэша":2589,"уникальных":2590,"благодаря":2591,"pathfinding":2592,"кэшах":2593,"set":2594,"contains":2595,"true":2596,"отлично":2597,"фильтрации":2598,"дубликатов":2599,"главное":2600,"помнить":2601,"горячих":2602,"путях":2603,"iequatable":2604,"выбрать":2605,"задача":2606,"рекомендуемая":2607,"redo":2608,"фильтрация":2609,"высоконагруженный":2610,"реальный":2611,"геймплей":2612,"кастомная":2613,"collections":2614,"применим":2615,"unmanaged":2616,"собственную":2617,"кольцевого":2618,"буфера":2619,"пустой":2620,"бросится":2621,"исключение":2622,"invalidoperationexception":2623,"_почему":2624,"хотя":2625,"тоже":2626,"addfirst":2627,"removefirst":2628,"массивах":2629,"узел":2630,"неизменяемый":2631,"immutable":2632,"фактически":2633,"синоним":2634,"любая":2635,"stringbuilder":2636,"буферизированный":2637,"изменяемый":2638,"эффективной":2639,"лишних":2640,"format":2641,"интерполяции":2642,"ключевое":2643,"слово":2644,"полностью":2645,"взаимозаменяемы":2646,"sealed":2647,"char":2648,"icomparable":2649,"др":2650,"операторы":2651,"substring":2652,"replace":2653,"split":2654,"toupper":2655,"интернируются":2656,"abc":2657,"ссылаться":2658,"дизайну":2659,"безопасности":2660,"упрощения":2661,"хэширования":2662,"кеширования":2663,"предсказуемость":2664,"изменяемыми":2665,"строку":2666,"могла":2667,"повлиять":2668,"другую":2669,"часть":2670,"immutability":2671,"исключает":2672,"side":2673,"effects":2674,"ещё":2675,"поскольку":2676,"изменяются":2677,"безопасно":2678,"экономит":2679,"ускоряет":2680,"вплоть":2681,"потокобезопасность":2682,"свободно":2683,"потоками":2684,"блокировок":2685,"хэш":2686,"таблиц":2687,"закешировать":2688,"опасаясь":2689,"строка":2690,"изменится":2691,"нарушит":2692,"целостность":2693,"простота":2694,"api":2695,"логично":2696,"сюрпризов":2697,"копировании":2698,"сравнении":2699,"изменение":2700,"интерполяция":2701,"for":2702,"копируется":2703,"заново":2704,"логирование":2705,"тексты":2706,"источники":2707,"text":2708,"позволяющий":2709,"накапливать":2710,"создания":2711,"append":2712,"appendformat":2713,"расширяющийся":2714,"значительно":2715,"циклах":2716,"массовых":2717,"преобразованиях":2718,"циклическая":2719,"массивная":2720,"конкатенация":2721,"генерация":2722,"логов":2723,"текстов":2724,"формирование":2725,"вне":2726,"layout":2727,"html":2728,"csv":2729,"дебаг":2730,"дампов":2731,"прочего":2732,"отсутствие":2733,"низкая":2734,"сборке":2735,"thread":2736,"safe":2737,"максимум":2738,"явных":2739,"ничем":2740,"языковое":2741,"оба":2742,"указывают":2743,"строками":2744,"цикле":2745,"создаются":2746,"старые":2747,"уходят":2748,"накапливаются":2749,"значит":2750,"компиляции":2751,"одинаковые":2752,"строковые":2753,"литералы":2754,"удобен":2755,"операциях":2756,"множественной":2757,"конкатенации":2758,"результаты":2759,"форматирования":2760,"enemy":2761,"boss":2762,"finalboss":2763,"базовые":2764,"понятия":2765,"которая":2766,"важное":2767,"меняется":2768,"таким":2769,"образом":2770,"мы":2771,"храним":2772,"имеем":2773,"типом":2774,"две":2775,"другая":2776,"upcasting":2777,"восходящее":2778,"определение":2779,"дочернего":2780,"родительскому":2781,"меняет":2782,"доступны":2783,"является":2784,"rigidbody":2785,"rb":2786,"gameobject":2787,"getcomponent":2788,"_твоя":2789,"добавь":2790,"своей":2791,"игры":2792,"quizrpg":2793,"vm":2794,"базовому":2795,"типу":2796,"_чтобы":2797,"закрепить":2798,"вставь":2799,"одно":2800,"своё":2801,"предложение":2802,"объясняющее":2803,"непосредственно":2804,"объявлены":2805,"присваивании":2806,"копия":2807,"собой":2808,"размещённый":2809,"управляемой":2810,"числе":2811,"хранение":2812,"inline":2813,"nullable":2814,"примитивы":2815,"byte":2816,"short":2817,"double":2818,"decimal":2819,"bool":2820,"обёртки":2821,"ограниченный":2822,"размеру":2823,"хранит":2824,"локальные":2825,"переменные":2826,"значимых":2827,"типов":2828,"очищается":2829,"управляется":2830,"экземпляров":2831,"ссылочных":2832,"collector":2833,"point":2834,"x":2835,"y":2836,"line":2837,"start":2838,"end":2839,"встроен":2840,"поле":2841,"находиться":2842,"вместе":2843,"этим":2844,"представлять":2845,"переданный":2846,"ref":2847,"копирование":2848,"получит":2849,"оригинал":2850,"происходить":2851,"этой":2852,"копией":2853,"затронут":2854,"исходный":2855,"ряде":2856,"случаев":2857,"байт":2858,"чрезмерное":2859,"нивелировать":2860,"выгоду":2861,"реализуемому":2862,"атрибуты":2863,"системными":2864,"пользовательскими":2865,"атрибутами":2866,"уровне":2867,"метаданных":2868,"навешивать":2869,"внедрять":2870,"информацию":2871,"обрабатываемую":2872,"рефлексией":2873,"системой":2874,"инспектора":2875,"serializefield":2876,"runtimeinitializeonloadmethod":2877,"сериализации":2878,"собственных":2879,"тулов":2880,"экземпляр":2881,"наследующегося":2882,"attribute":2883,"стандартные":2884,"obsolete":2885,"serializable":2886,"dllimport":2887,"специфичные":2888,"contextmenu":2889,"executealways":2890,"пользовательские":2891,"обрабатывая":2892,"рефлексию":2893,"простого":2894,"кастомного":2895,"атрибута":2896,"attributeusage":2897,"attributetargets":2898,"custominfoattribute":2899,"info":2900,"get":2901,"memberinfo":2902,"getcustomattributes":2903,"getcustomattribute":2904,"назначение":2905,"инспектор":2906,"tooltip":2907,"range":2908,"requirecomponent":2909,"disallowmultiplecomponent":2910,"инициализация":2911,"initializeonloadmethod":2912,"редактор":2913,"menuitem":2914,"customeditor":2915,"механика":2916,"рефлексии":2917,"inherited":2918,"allowmultiple":2919,"многие":2920,"анализируются":2921,"этапе":2922,"редактора":2923,"serializedobject":2924,"monoimporter":2925,"editorapplication":2926,"влияют":2927,"тех":2928,"обрабатываются":2929,"самим":2930,"специфика":2931,"заставляет":2932,"приватное":2933,"awake":2934,"редакторе":2935,"кнопку":2936,"объекте":2937,"_кастомный":2938,"пайплайн":2939,"сериализации_":2940,"независимый":2941,"поэтому":2942,"равнозначны":2943,"сериализуется":2944,"видно":2945,"инкапсуляцию":2946,"сериализацию":2947,"сохраняя":2948,"инициализации":2949,"синглтонов":2950,"регистраций":2951,"полям":2952,"mycustomvalidation":2953,"навесить":2954,"атрибутов":2955,"понимает":2956,"парсит":2957,"итераторы":2958,"ienumerator":2959,"yield":2960,"связано":2961,"производительностью":2962,"итератор":2963,"предоставляющий":2964,"поэлементный":2965,"последовательности":2966,"внутреннюю":2967,"структуру":2968,"определить":2969,"ленивую":2970,"последовательность":2971,"определяющие":2972,"коллекциям":2973,"перечислителю":2974,"проходить":2975,"элементам":2976,"другим":2977,"скрывают":2978,"упрощая":2979,"написание":2980,"ленивых":2981,"потоковых":2982,"коллекций":2983,"временных":2984,"пройти":2985,"getenumerator":2986,"movenext":2987,"current":2988,"reset":2989,"современный":2990,"дженерики":2991,"безопаснее":2992,"типам":2993,"поддерживают":2994,"linq":2995,"разбить":2996,"превращает":2997,"machine":2998,"кулисами":2999,"скрытый":3000,"переход":3001,"новое":3002,"generate":3003,"ленивый":3004,"запроса":3005,"бесконечными":3006,"последовательностями":3007,"большим":3008,"объёмом":3009,"допустимые":3010,"конструкции":3011,"expr":3012,"вернуть":3013,"break":3014,"завершить":3015,"перечисление":3016,"досрочно":3017,"try":3018,"finally":3019,"catch":3020,"анонимных":3021,"функциях":3022,"this":3023,"оператор":3024,"запрашивает":3025,"берёт":3026,"поддерживающий":3027,"именами":3028,"промежуточных":3029,"эффективна":3030,"работа":3031,"фильтрацией":3032,"трансформацией":3033,"where":3034,"select":3035,"rewind":3036,"обращаться":3037,"отлаживать":3038,"индекс":3039,"текущим":3040,"положением":3041,"полями":3042,"ожидает":3043,"явную":3044,"именем":3045,"бесконечный":3046,"while":3047,"генераторы":3048,"шум":3049,"окончания":3050,"возвращать":3051,"неопределён":3052,"выбросить":3053,"параметра":3054,"выходной":3055,"параметр":3056,"обязательна":3057,"методе":3058,"вариантность":3059,"ковариация":3060,"контравариация":3061,"обобщённых":3062,"интерфейсах":3063,"делегатах":3064,"возвращаемый":3065,"производным":3066,"принимаемый":3067,"базовым":3068,"modify":3069,"аналог":3070,"указателей":3071,"исходной":3072,"tryparse":3073,"result":3074,"обязан":3075,"завершения":3076,"побочным":3077,"результатом":3078,"парсинг":3079,"передает":3080,"гарантирует":3081,"неизменность":3082,"крупных":3083,"matrix4x4":3084,"ray":3085,"ситуаций":3086,"гарантировать":3087,"передаются":3088,"мелких":3089,"vector2":3090,"эффективнее":3091,"копии":3092,"упаковка":3093,"iinterface":3094,"передается":3095,"математических":3096,"вычислений":3097,"dots":3098,"оптимальное":3099,"calculate":3100,"sqrmagnitude":3101,"неэффективные":3102,"случаи":3103,"print":3104,"number":3105,"мелкая":3106,"process":3107,"m":3108,"externalmethod":3109,"создаст":3110,"рефлексия":3111,"получения":3112,"информации":3113,"типах":3114,"ими":3115,"существенно":3116,"почти":3117,"применение":3118,"контейнерах":3119,"кастомной":3120,"инструментах":3121,"анализировать":3122,"объектами":3123,"fieldinfo":3124,"methodinfo":3125,"constructorinfo":3126,"имени":3127,"знания":3128,"медленная":3129,"оптимизации":3130,"встроить":3131,"проанализировать":3132,"пути":3133,"inlining":3134,"структурам":3135,"упаковку":3136,"распаковку":3137,"compilation":3138,"инструкций":3139,"инструкция":3140,"интерпретатора":3141,"маршалинг":3142,"защита":3143,"каждым":3144,"вызовом":3145,"корректности":3146,"замерам":3147,"прямого":3148,"существенная":3149,"просадка":3150,"обработке":3151,"небезопасность":3152,"обойти":3153,"сломать":3154,"неочевидный":3155,"типовой":3156,"ошибки":3157,"линкером":3158,"имён":3159,"вырезаны":3160,"указаны":3161,"link":3162,"xml":3163,"фреймворках":3164,"аналогичные":3165,"фреймворки":3166,"причины":3167,"автоматизация":3168,"boilerplate":3169,"искать":3170,"авто":3171,"инжектить":3172,"сканировать":3173,"поддержка":3174,"инъекций":3175,"приватные":3176,"существующего":3177,"режим":3178,"кеширует":3179,"полученные":3180,"запуске":3181,"загрузке":3182,"похожие":3183,"сохранения":3184,"injectattribute":3185,"concreteidbinder":3186,"scriptableobjectinstaller":3187,"вырезания":3188,"автоинспекторов":3189,"генерации":3190,"форм":3191,"дебага":3192,"сериализаторов":3193,"старте":3194,"разовых":3195,"служебных":3196,"задачах":3197,"логгинг":3198,"автоскан":3199,"разбор":3200,"любых":3201,"fixedupdate":3202,"ontriggerenter":3203,"перемещении":3204,"гарантированно":3205,"сохранены":3206,"абстракцию":3207,"медленно":3208,