{"word_to_stem":{},"stem_to_sid":{},"word_to_id":{"":0,"основное":1,"кратко":2,"сложность":3,"алгоритма":4,"показывает":5,"как":6,"быстро":7,"растёт":8,"время":9,"выполнения":10,"или":11,"объём":12,"памяти":13,"при":14,"увеличении":15,"входных":16,"данных":17,"записывается":18,"o":19,"используется":20,"для":21,"оценки":22,"и":23,"сравнения":24,"производительности":25,"часто":26,"используемые":27,"классы":28,"сложности":29,"обозначение":30,"название":31,"пример":32,"комментарий":33,"1":34,"константная":35,"доступ":36,"по":37,"индексу":38,"array":39,"i":40,"не":41,"зависит":42,"от":43,"размера":44,"входа":45,"log":46,"n":47,"логарифмическая":48,"бинарный":49,"поиск":50,"в":51,"отсортированном":52,"массиве":53,"делим":54,"на":55,"2":56,"каждом":57,"шаге":58,"линейная":59,"перебор":60,"всех":61,"элементов":62,"каждое":63,"значение":64,"смотрится":65,"один":66,"раз":67,"линейно":68,"логарифм":69,"быстрая":70,"сортировка":71,"merge":72,"sort":73,"оптимум":74,"сортировки":75,"сравнениями":76,"n²":77,"квадратичная":78,"вложенные":79,"циклы":80,"сравнение":81,"со":82,"всеми":83,"деградирует":84,"росте":85,"2ⁿ":86,"экспоненциальная":87,"подмножеств":88,"комбинаторика":89,"практически":90,"без":91,"оптимизаций":92,"визуальное":93,"роста":94,"размер":95,"10":96,"3":97,"30":98,"100":99,"7":100,"700":101,"000":102,"1000":103,"млн":104,"собеседованиях":105,"спрашивают":106,"q1":107,"почему":108,"работает":109,"за":110,"делит":111,"массив":112,"пополам":113,"логарифмическое":114,"количество":115,"шагов":116,"q2":117,"можно":118,"ли":119,"улучшить":120,"сортировку":121,"быстрее":122,"чем":123,"нет":124,"алгоритмов":125,"основанных":126,"сравнениях":127,"это":128,"теоретический":129,"предел":130,"q3":131,"опасны":132,"ведут":133,"к":134,"выше":135,"критично":136,"больших":137,"объемах":138,"q4":139,"важно":140,"понимать":141,"unity":142,"чтобы":143,"делать":144,"например":145,"find":146,"update":147,"foreach":148,"каждый":149,"кадр":150,"может":151,"давать":152,"микролаги":153,"gc":154,"q5":155,"где":156,"поведение":157,"quadtree":158,"octree":159,"пространству":160,"отсортированных":161,"структурах":162,"события":163,"таймеры":164,"буферы":165,"место":166,"подробного":167,"разбора":168,"частые":169,"вопросы":170,"анимации":171,"уже":172,"готовы":173,"экспорт":174,"анимаций":175,"из":176,"spine":177,"https":178,"www":179,"youtube":180,"com":181,"watch":182,"v":183,"j0mgh4mvbgc":184,"harmony":185,"8fuyyg2ogi8":186,"создание":187,"animationcontroller":188,"создавать":189,"используя":190,"rigging":191,"cy789ni2qxi":192,"интеграция":193,"dxdzttk2nle":194,"бесплатный":195,"тестовый":196,"спайн":197,"assetstore":198,"packages":199,"3d":200,"animations":201,"free":202,"2d":203,"character":204,"animation":205,"177560":206,"content":207,"png":208,"сета":209,"hkaysu1z":210,"n8":211,"t":212,"849s":213,"какая":214,"проблема":215,"есть":216,"чего":217,"dependency":218,"injection":219,"стандартном":220,"scripting":221,"framework":222,"usf":223,"зависимости":224,"реализуются":225,"через":226,"ссылки":227,"сути":228,"реализация":229,"ecs":230,"components":231,"systems":232,"данные":233,"операции":234,"с":235,"ними":236,"monobehaviours":237,"а":238,"entity":239,"сущность":240,"id":241,"gameobjects":242,"том":243,"что":244,"дефолту":245,"такой":246,"схеме":247,"компонент":248,"знает":249,"о":250,"других":251,"сущностях":252,"компонентах":253,"т":254,"е":255,"своих":256,"зависимостях":257,"обеспечения":258,"связей":259,"приложении":260,"ioc":261,"container":262,"inversion":263,"of":264,"control":265,"объект":266,"который":267,"создает":268,"содержит":269,"которые":270,"должны":271,"внедрены":272,"объекты":273,"приложения":274,"такое":275,"di":276,"архитектура":277,"паттерн":278,"которой":279,"внедряет":280,"другого":281,"объекта":282,"зависимость":283,"нужен":284,"классу":285,"своего":286,"кода":287,"внедрение":288,"передача":289,"зависимому":290,"объекту":291,"обеспечивать":292,"свои":293,"выполнять":294,"другие":295,"такие":296,"предоставляет":297,"zenject":298,"injections":299,"constructor":300,"field":301,"method":302,"property":303,"зависимостей":304,"bindings":305,"привязка":306,"типа":307,"экземпляру":308,"installers":309,"предоставляют":310,"ios":311,"контейнеру":312,"все":313,"context":314,"связывание":315,"инсталлера":316,"контейнера":317,"также":318,"иногда":319,"проектах":320,"делают":321,"облегченные":322,"версии":323,"dicontainer":324,"которых":325,"компенсировать":326,"следующие":327,"минусы":328,"слишком":329,"частое":330,"использование":331,"system":332,"reflection":333,"runtime":334,"рекомендуется":335,"минимизировать":336,"дороговизны":337,"получение":338,"определенного":339,"проектного":340,"сцены":341,"этого":342,"тут":343,"же":344,"добавить":345,"ивенты":346,"разных":347,"контейнеров":348,"оптимизация":349,"внедрения":350,"monobehaviour":351,"вместо":352,"использования":353,"injectgameobject":354,"проходит":355,"всей":356,"иерархии":357,"доп":358,"интерфейсы":359,"огромен":360,"большинство":361,"функционала":362,"никогда":363,"пригождается":364,"geeksforgeeks":365,"org":366,"difference":367,"between":368,"mvc":369,"mvp":370,"and":371,"mvvm":372,"architecture":373,"pattern":374,"in":375,"android":376,"model":377,"view":378,"controller":379,"модель":380,"вид":381,"контроллер":382,"представляет":383,"реагирует":384,"команды":385,"контроллера":386,"изменяя":387,"свое":388,"состояние":389,"отвечает":390,"взаимодействие":391,"внешними":392,"данными":393,"отображение":394,"модели":395,"реагируя":396,"изменения":397,"интерпретирует":398,"действия":399,"пользователя":400,"оповещая":401,"необходимости":402,"изменений":403,"он":404,"обновляет":405,"только":406,"визуал":407,"логика":408,"ввод":409,"обновление":410,"связи":411,"менее":412,"изолированные":413,"хуже":414,"тестируемость":415,"ui":416,"presenter":417,"представление":418,"разница":419,"имеет":420,"прямой":421,"эту":422,"связь":423,"обеспечивает":424,"решает":425,"отображать":426,"контролируя":427,"обрабатывает":428,"обновляя":429,"между":430,"пассивна":431,"всё":432,"хорошо":433,"подходит":434,"unit":435,"тестов":436,"чёткая":437,"структура":438,"viewmodel":439,"похож":440,"отличие":441,"нужные":442,"представления":443,"отделены":444,"базовой":445,"core":446,"логики":447,"абстракция":448,"информирует":449,"действиях":450,"отображает":451,"той":452,"самостоятельной":453,"имеющие":454,"отношение":455,"представлению":456,"биндинги":457,"связаны":458,"binding":459,"удобно":460,"реактивностью":461,"data":462,"меньше":463,"ручной":464,"viper":465,"interactor":466,"бизнес":467,"связывает":468,"слои":469,"router":470,"навигация":471,"строго":472,"изолированы":473,"сложных":474,"многоэкранных":475,"сценариев":476,"легко":477,"масштабируется":478,"тестируется":479,"отличия":480,"про":481,"ничего":482,"всю":483,"логику":484,"держит":485,"изолирован":486,"вынесены":487,"отдельно":488,"жестко":489,"проблему":490,"связуещего":491,"звена":492,"реализуется":493,"событиями":494,"сочетается":495,"реактивным":496,"программированием":497,"делает":498,"более":499,"гибким":500,"отделение":501,"ко":502,"многим":503,"быть":504,"реализован":505,"разными":506,"одному":507,"одной":508,"применены":509,"разные":510,"input":511,"обрабатывается":512,"сложно":513,"тестировать":514,"тестирование":515,"осложняет":516,"жесткая":517,"легкое":518,"счет":519,"нежестких":520,"выбрали":521,"отделить":522,"кроме":523,"того":524,"применения":525,"разным":526,"были":527,"окна":528,"инпутом":529,"но":530,"одинаковыми":531,"входными":532,"выходными":533,"позволило":534,"сделать":535,"инструмент":536,"эдиторе":537,"тестирования":538,"solid":539,"акроним":540,"каждая":541,"буква":542,"5":543,"основных":544,"принципов":545,"ооп":546,"s":547,"single":548,"responsibility":549,"принцип":550,"единственной":551,"ответственности":552,"должен":553,"иметь":554,"какую":555,"то":556,"одну":557,"функциональность":558,"эта":559,"должна":560,"инкапсулирована":561,"класс":562,"oped":563,"closed":564,"открытости":565,"закрытости":566,"открыты":567,"расширения":568,"закрыты":569,"поведения":570,"l":571,"liskov":572,"substitution":573,"подстановки":574,"барбары":575,"лисков":576,"наследник":577,"дополняет":578,"заменяет":579,"базовый":580,"они":581,"могли":582,"бы":583,"использоваться":584,"родительских":585,"классов":586,"нарушая":587,"работу":588,"программы":589,"interface":590,"segregation":591,"разделения":592,"интерфейсов":593,"разделение":594,"так":595,"было":596,"неиспользуемых":597,"методов":598,"d":599,"принци":600,"инверсии":601,"модули":602,"верхних":603,"уровней":604,"зависеть":605,"модулей":606,"нижних":607,"абстракции":608,"конкретных":609,"деталей":610,"реализации":611,"тогда":612,"детали":613,"абстракций":614,"какие":615,"принципы":616,"лежат":617,"основе":618,"объектно":619,"ориентированного":620,"программирования":621,"полезны":622,"проблемы":623,"решают":624,"чём":625,"абстракцией":626,"инкапсуляцией":627,"наследованием":628,"полиморфизмом":629,"опирается":630,"четыре":631,"базовых":632,"принципа":633,"инкапсуляция":634,"наследование":635,"полиморфизм":636,"эти":637,"позволяют":638,"строить":639,"гибкие":640,"переиспользуемые":641,"расширяемые":642,"архитектуры":643,"помогают":644,"упростить":645,"сложные":646,"системы":647,"скрыть":648,"уменьшить":649,"связанность":650,"компонентов":651,"практике":652,"scriptableobject":653,"компоненты":654,"выделение":655,"существенных":656,"характеристик":657,"игнорирование":658,"несущественных":659,"weapon":660,"определять":661,"метод":662,"fire":663,"раскрывая":664,"конкретно":665,"стреляют":666,"виды":667,"оружия":668,"цель":669,"предоставив":670,"простой":671,"интерфейс":672,"c":673,"абстрактные":674,"abstract":675,"означает":676,"сокрытие":677,"внутреннего":678,"состояния":679,"управление":680,"доступом":681,"нему":682,"данным":683,"осуществляется":684,"публичные":685,"методы":686,"свойства":687,"поля":688,"private":689,"protected":690,"помощью":691,"модификаторов":692,"доступа":693,"public":694,"internal":695,"позволяет":696,"защитить":697,"некорректного":698,"описать":699,"отношения":700,"общими":701,"частными":702,"типами":703,"производный":704,"даёт":705,"возможность":706,"повторно":707,"использовать":708,"код":709,"расширять":710,"дублирования":711,"поддерживается":712,"одиночное":713,"class":714,"a":715,"b":716,"имитировать":717,"множественное":718,"объектам":719,"одинаковым":720,"интерфейсом":721,"вести":722,"себя":723,"разному":724,"возможно":725,"счёт":726,"переопределения":727,"override":728,"компилятор":729,"рантайм":730,"могут":731,"обрабатывать":732,"ссылку":733,"тип":734,"виртуальные":735,"делегаты":736,"каверзные":737,"скрывает":738,"простым":739,"ограничивает":740,"внутреннему":741,"состоянию":742,"реализовать":743,"наследования":744,"ienemy":745,"классами":746,"связанными":747,"запрещено":748,"избежать":749,"проблем":750,"ромбовидного":751,"конфликта":752,"альтернатива":753,"композицию":754,"отличается":755,"содержать":756,"реализацию":757,"сигнатуры":758,"до":759,"8":760,"0":761,"множественно":762,"абстрактный":763,"_что":764,"principle":765,"связан":766,"_":767,"подкласса":768,"корректно":769,"заменять":770,"базового":771,"класса":772,"нарушение":773,"приводит":774,"неожиданному":775,"поведению":776,"использовании":777,"интерфейса":778,"архитектурного":779,"решения":780,"опишите":781,"вы":782,"спроектировали":783,"архитектуру":784,"какого":785,"либо":786,"игрового":787,"модуля":788,"структурировать":789,"систему":790,"управления":791,"игровыми":792,"уровнями":793,"инвентаря":794,"мобильной":795,"игре":796,"здесь":797,"оценивается":798,"умение":799,"разбивать":800,"выделять":801,"применять":802,"паттерны":803,"проектирования":804,"организации":805,"todo":806,"краткая":807,"обобщающая":808,"информация":809,"теме":810,"ответ":811,"вопрос":812,"строки":813,"глубокого":814,"понимания":815,"вопроса":816,"обычно":817,"задают":818,"звездочкой":819,"kiss":820,"keep":821,"it":822,"simple":823,"stupid":824,"усложнять":825,"писать":826,"просто":827,"надежно":828,"небольшие":829,"решающие":830,"лишнего":831,"dry":832,"don":833,"repeat":834,"yourself":835,"избегать":836,"переиспользовать":837,"yagni":838,"you":839,"are":840,"not":841,"gonna":842,"need":843,"реализовывать":844,"нужно":845,"сейчас":846,"ваши":847,"небольшими":848,"40":849,"50":850,"строк":851,"модификации":852,"будущем":853,"должно":854,"возникнуть":855,"трудностей":856,"4":857,"система":858,"лучше":859,"всего":860,"если":861,"она":862,"усложняется":863,"надобности":864,"устанавливайте":865,"целую":866,"библиотеку":867,"ради":868,"функции":869,"неё":870,"6":871,"делай":872,"просят":873,"необходимо":874,"дубово":875,"избегайте":876,"копирования":877,"выносите":878,"общую":879,"прежде":880,"добавлять":881,"функционал":882,"проверьте":883,"проекте":884,"создан":885,"константы":886,"реализуйте":887,"теории":888,"оно":889,"пригодится":890,"подчищайте":891,"ненужный":892,"найдите":893,"git":894,"историю":895,"программист":896,"новый":897,"котором":898,"его":899,"благими":900,"намерениями":901,"должной":902,"проверки":903,"добавите":904,"багов":905,"шаблоны":906,"gof":907,"grasp":908,"game":909,"programming":910,"patterns":911,"зачем":912,"нужны":913,"применяются":914,"шаблонов":915,"чаще":916,"игровой":917,"разработке":918,"различия":919,"паттернами":920,"знать":921,"наизусть":922,"важнее":923,"уметь":924,"проверенные":925,"временем":926,"типовых":927,"архитектурных":928,"задач":929,"gang":930,"four":931,"классические":932,"23":933,"штуки":934,"разделенные":935,"категории":936,"порождающие":937,"структурные":938,"поведенческие":939,"general":940,"assignment":941,"software":942,"распределения":943,"адаптация":944,"паттернов":945,"под":946,"задачи":947,"геймдева":948,"используют":949,"комбинации":950,"этих":951,"подходов":952,"адаптируя":953,"особенности":954,"движка":955,"монобехи":956,"сериализация":957,"классических":958,"шаблона":959,"сформулированных":960,"книге":961,"_design":962,"elements":963,"reusable":964,"object":965,"oriented":966,"software_":967,"разделяются":968,"категория":969,"примеры":970,"singleton":971,"factory":972,"builder":973,"adapter":974,"composite":975,"decorator":976,"state":977,"observer":978,"command":979,"strategy":980,"идея":981,"снизить":982,"гибкой":983,"суть":984,"information":985,"expert":986,"ответственность":987,"у":988,"кто":989,"creator":990,"создаёт":991,"им":992,"владеет":993,"использует":994,"принимает":995,"пользовательский":996,"управляет":997,"логикой":998,"low":999,"coupling":1000,"слабо":1001,"high":1002,"cohesion":1003,"polymorphism":1004,"делегирование":1005,"variations":1006,"закрыть":1007,"интерфейсами":1008,"абстракциями":1009,"основа":1010,"здравого":1011,"применяется":1012,"интуитивно":1013,"особенно":1014,"robert":1015,"nystrom":1016,"практичные":1017,"адаптированные":1018,"real":1019,"time":1020,"ограничение":1021,"движков":1022,"component":1023,"loop":1024,"jobsystem":1025,"event":1026,"queue":1027,"внутренние":1028,"decoupled":1029,"вызовы":1030,"ai":1031,"игровые":1032,"undo":1033,"buffer":1034,"репликация":1035,"service":1036,"locator":1037,"замена":1038,"audiomanager":1039,"instance":1040,"play":1041,"dirty":1042,"flag":1043,"пересчётов":1044,"флаг":1045,"изменении":1046,"подходы":1047,"конструкторы":1048,"сервисная":1049,"iuiservice":1050,"igamestateservice":1051,"ключевые":1052,"геймплейной":1053,"чистых":1054,"модулях":1055,"их":1056,"применить":1057,"выбор":1058,"переключение":1059,"состояний":1060,"объединяются":1061,"стратегия":1062,"напрямую":1063,"ограничений":1064,"проще":1065,"неявными":1066,"зло":1067,"нарушает":1068,"явность":1069,"плохо":1070,"усложняет":1071,"жизненным":1072,"циклом":1073,"сервис":1074,"локаторы":1075,"объектов":1076,"даже":1077,"принципу":1078,"д":1079,"_какой":1080,"сетевого":1081,"универсален":1082,"отложенного":1083,"отмены":1084,"реплеев":1085,"синхронизации":1086,"действий":1087,"организовать":1088,"ci":1089,"cd":1090,"проекта":1091,"инструменты":1092,"наиболее":1093,"популярны":1094,"cloud":1095,"build":1096,"jenkins":1097,"github":1098,"actions":1099,"автоматизировать":1100,"сборки":1101,"юнитетсы":1102,"выкладку":1103,"билдов":1104,"автоматизирует":1105,"процессы":1106,"качества":1107,"выкладки":1108,"коробки":1109,"гибкость":1110,"gitlab":1111,"bitrise":1112,"инфраструктуры":1113,"уровня":1114,"кастомизации":1115,"бюджета":1116,"требуемой":1117,"прозрачности":1118,"автоматизируются":1119,"юнит":1120,"тесты":1121,"артефактов":1122,"деплой":1123,"testflight":1124,"google":1125,"s3":1126,"discord":1127,"облачный":1128,"встраивается":1129,"dashboard":1130,"простая":1131,"настройка":1132,"подключение":1133,"репозитория":1134,"целевой":1135,"платформы":1136,"автоматический":1137,"триггер":1138,"коммитов":1139,"поддерживает":1140,"multiple":1141,"targets":1142,"webgl":1143,"version":1144,"scm":1145,"credentials":1146,"automation":1147,"with":1148,"post":1149,"pre":1150,"export":1151,"methods":1152,"платный":1153,"большом":1154,"объеме":1155,"ограничена":1156,"скриптуемости":1157,"полной":1158,"shell":1159,"доступности":1160,"неудобно":1161,"кастомных":1162,"пайплайнов":1163,"кроссплатформенный":1164,"сервер":1165,"кастомизацией":1166,"продвинутых":1167,"командах":1168,"контроль":1169,"инфраструктурой":1170,"основные":1171,"элементы":1172,"jenkinsfile":1173,"freestyle":1174,"job":1175,"cli":1176,"batchmode":1177,"nographics":1178,"executemethod":1179,"шаги":1180,"checkout":1181,"compile":1182,"run":1183,"tests":1184,"upload":1185,"установленный":1186,"editor":1187,"docker":1188,"контейнер":1189,"hub":1190,"activation":1191,"интегрируют":1192,"fastlane":1193,"artifactory":1194,"slack":1195,"нативный":1196,"лимита":1197,"удобной":1198,"yaml":1199,"конфигурацией":1200,"хорошей":1201,"интеграцией":1202,"pull":1203,"requests":1204,"issues":1205,"releases":1206,"образ":1207,"runner":1208,"поддерживаются":1209,"секреты":1210,"кэширование":1211,"library":1212,"автоматического":1213,"билда":1214,"apk":1215,"aab":1216,"zip":1217,"настроить":1218,"пуш":1219,"itch":1220,"io":1221,"firebase":1222,"hosting":1223,"практические":1224,"советы":1225,"хардкодьте":1226,"параметры":1227,"platform":1228,"path":1229,"defines":1230,"buildconfig":1231,"используйте":1232,"отдельный":1233,"script":1234,"buildpipeline":1235,"buildplayer":1236,"ядро":1237,"храните":1238,"версию":1239,"одном":1240,"месте":1241,"cs":1242,"json":1243,"projectsettings":1244,"asset":1245,"отделяйте":1246,"скрипты":1247,"подключите":1248,"статический":1249,"анализ":1250,"всегда":1251,"сохраняйте":1252,"артефакты":1253,"кэш":1254,"xcode":1255,"требует":1256,"подписания":1257,"когда":1258,"какой":1259,"выбирать":1260,"устроен":1261,"вызвать":1262,"командной":1263,"кешировать":1264,"_как":1265,"управлять":1266,"сборочными":1267,"конфигурациями":1268,"prod":1269,"dev":1270,"debug":1271,"flow":1272,"отличаются":1273,"ветвления":1274,"trunk":1275,"based":1276,"ту":1277,"иную":1278,"стратегию":1279,"соглашения":1280,"веткам":1281,"коммитам":1282,"приняты":1283,"команде":1284,"распределённая":1285,"контроля":1286,"версий":1287,"позволяющая":1288,"каждому":1289,"участнику":1290,"полную":1291,"копию":1292,"одна":1293,"стратегий":1294,"структурирующая":1295,"над":1296,"фичами":1297,"релизами":1298,"хотфиксами":1299,"команд":1300,"предсказуемым":1301,"релизов":1302,"избыточной":1303,"fast":1304,"paced":1305,"альтернативные":1306,"выбираются":1307,"скорости":1308,"процесса":1309,"qa":1310,"основы":1311,"работы":1312,"dvcs":1313,"distributed":1314,"коммиты":1315,"ветки":1316,"мержи":1317,"происходят":1318,"локально":1319,"лишь":1320,"push":1321,"синхронизируются":1322,"удалённым":1323,"репозиторием":1324,"snapshot":1325,"коммит":1326,"ссылка":1327,"снимок":1328,"метаданные":1329,"автор":1330,"сообщение":1331,"родительский":1332,"мощную":1333,"поддержку":1334,"слияния":1335,"обеспечивая":1336,"быстрое":1337,"ветками":1338,"switch":1339,"независимую":1340,"разработку":1341,"feature":1342,"ветках":1343,"безопасные":1344,"эксперименты":1345,"stash":1346,"reflog":1347,"cherry":1348,"pick":1349,"rebase":1350,"лёгкое":1351,"восстановление":1352,"удалённых":1353,"стратегии":1354,"vincent":1355,"driessen":1356,"ориентирована":1357,"релизный":1358,"цикл":1359,"main":1360,"стабильная":1361,"прод":1362,"версия":1363,"релизы":1364,"develop":1365,"интеграционная":1366,"ветка":1367,"фичи":1368,"мержатся":1369,"сюда":1370,"новые":1371,"мерж":1372,"release":1373,"подготовка":1374,"релизу":1375,"hotfix":1376,"экстренные":1377,"фиксы":1378,"преимущества":1379,"чёткое":1380,"удобство":1381,"предсказуемые":1382,"недостатки":1383,"много":1384,"веток":1385,"сложнее":1386,"визуально":1387,"мержить":1388,"continuous":1389,"deployment":1390,"development":1391,"основная":1392,"используются":1393,"короткоживущие":1394,"branches":1395,"flags":1396,"плюсы":1397,"упрощённая":1398,"максимальная":1399,"совместимость":1400,"доставка":1401,"фич":1402,"высокой":1403,"дисциплины":1404,"покрытия":1405,"тестами":1406,"потенциально":1407,"больше":1408,"конфликтов":1409,"параллельной":1410,"работе":1411,"упрощённые":1412,"вариации":1413,"master":1414,"делаются":1415,"отдельных":1416,"проходят":1417,"request":1418,"затем":1419,"вливаются":1420,"production":1421,"staging":1422,"окружений":1423,"практика":1424,"проектов":1425,"артефактами":1426,"билды":1427,"meta":1428,"игнорировать":1429,"сгенерированные":1430,"файлы":1431,"gitignore":1432,"temp":1433,"п":1434,"хранить":1435,"обязательны":1436,"guid":1437,"ссылок":1438,"сценах":1439,"ассетах":1440,"конфликты":1441,"prefab":1442,"стоит":1443,"настраивать":1444,"smart":1445,"lock":1446,"plastic":1447,"командные":1448,"префиксы":1449,"bugfix":1450,"названия":1451,"player":1452,"movement":1453,"crash":1454,"сообщения":1455,"feat":1456,"добавлено":1457,"движение":1458,"fix":1459,"исправлен":1460,"баг":1461,"мержей":1462,"commit":1463,"триггеры":1464,"билд":1465,"сохраняет":1466,"объединения":1467,"переписывает":1468,"делая":1469,"её":1470,"линейной":1471,"опасен":1472,"публичных":1473,"чистки":1474,"истории":1475,"перед":1476,"неэффективен":1477,"изоляция":1478,"стабильность":1479,"избыточная":1480,"замедление":1481,"интеграции":1482,"использовали":1483,"частого":1484,"мёрджа":1485,"убирает":1486,"необходимость":1487,"идеален":1488,"высоким":1489,"уровнем":1490,"автоматизации":1491,"squash":1492,"объединяет":1493,"сжатия":1494,"вливанием":1495,"сохранить":1496,"чистоту":1497,"файлах":1498,"lfs":1499,"tool":1500,"редактирование":1501,"сцен":1502,"коммуникацию":1503,"блокировки":1504,"liveops":1505,"ab":1506,"внутриигровые":1507,"предложения":1508,"сервисов":1509,"remote":1510,"config":1511,"gametune":1512,"gameanalytics":1513,"applovin":1514,"max":1515,"sdk":1516,"непрерывный":1517,"участок":1518,"фиксированной":1519,"длиной":1520,"неудобен":1521,"управлении":1522,"list":1523,"обёртка":1524,"массивом":1525,"динамической":1526,"аллокацией":1527,"эффективен":1528,"постепенном":1529,"dictionary":1530,"tkey":1531,"tvalue":1532,"хеш":1533,"таблица":1534,"bucket":1535,"списками":1536,"ячейками":1537,"оптимален":1538,"быстрых":1539,"lookups":1540,"память":1541,"операция":1542,"блок":1543,"header":1544,"length":1545,"внутренний":1546,"capacity":1547,"count":1548,"buckets":1549,"entries":1550,"key":1551,"value":1552,"hashcode":1553,"next":1554,"расположение":1555,"куче":1556,"struct":1557,"подряд":1558,"внутри":1559,"раскиданы":1560,"разбросаны":1561,"фрагментацией":1562,"адрес":1563,"base":1564,"sizeof":1565,"неприменимо":1566,"индексов":1567,"ключу":1568,"установка":1569,"прямая":1570,"запись":1571,"ячейку":1572,"во":1573,"dict":1574,"значению":1575,"линейный":1576,"values":1577,"keys":1578,"перебором":1579,"среднем":1580,"коллизиях":1581,"вставка":1582,"конец":1583,"невозможна":1584,"требуется":1585,"создать":1586,"амортизированно":1587,"соответствующий":1588,"удаление":1589,"сдвиг":1590,"после":1591,"удалённого":1592,"remove":1593,"вызывает":1594,"массива":1595,"известен":1596,"иначе":1597,"итерация":1598,"максимально":1599,"идут":1600,"чуть":1601,"медленнее":1602,"структуры":1603,"включать":1604,"пустые":1605,"удалённые":1606,"ячейки":1607,"реаллокация":1608,"вручную":1609,"new":1610,"автоматически":1611,"превышении":1612,"resize":1613,"происходит":1614,"loadfactor":1615,"полного":1616,"перестроения":1617,"базовая":1618,"коллекция":1619,"net":1620,"представляющая":1621,"длины":1622,"непрерывной":1623,"памятью":1624,"производительных":1625,"операций":1626,"заранее":1627,"изменяется":1628,"внутреннее":1629,"устройство":1630,"располагаются":1631,"пропусков":1632,"называется":1633,"структурой":1634,"служебный":1635,"заголовок":1636,"длина":1637,"сами":1638,"последовательно":1639,"разрывов":1640,"отличная":1641,"локальность":1642,"рядом":1643,"логике":1644,"находятся":1645,"обращении":1646,"процессор":1647,"загрузит":1648,"остальные":1649,"подлежит":1650,"изменению":1651,"доступе":1652,"загружает":1653,"соседние":1654,"итерации":1655,"векторные":1656,"вычисления":1657,"быстрыми":1658,"фиксирован":1659,"создании":1660,"нельзя":1661,"изменить":1662,"работают":1663,"вычисляется":1664,"хранения":1665,"структур":1666,"vector3":1667,"float":1668,"int":1669,"максимальную":1670,"плотность":1671,"производительность":1672,"динамический":1673,"список":1674,"поверх":1675,"универсальная":1676,"реализующая":1677,"обёртку":1678,"автоматическим":1679,"управлением":1680,"размером":1681,"предназначен":1682,"упорядоченных":1683,"возможностью":1684,"добавления":1685,"удаления":1686,"_items":1687,"хранилище":1688,"_size":1689,"реально":1690,"добавленных":1691,"выделенного":1692,"элемента":1693,"вместить":1694,"аллокации":1695,"ступ":1696,"вызова":1697,"clear":1698,"остаётся":1699,"деаллокации":1700,"повторного":1701,"использовани":1702,"empty":1703,"первый":1704,"add":1705,"первую":1706,"аллокацию":1707,"переполнении":1708,"копированием":1709,"удвоенного":1710,"16":1711,"32":1712,"добавление":1713,"середине":1714,"сдвигом":1715,"известно":1716,"ожидаемое":1717,"сразу":1718,"указать":1719,"var":1720,"foo":1721,"избежит":1722,"каскада":1723,"аллокаций":1724,"копирований":1725,"списка":1726,"сбрасывает":1727,"освобождает":1728,"новых":1729,"trimexcess":1730,"уменьшает":1731,"пар":1732,"ключ":1733,"реализованная":1734,"массивами":1735,"оптимальна":1736,"быстрого":1737,"поиска":1738,"вставки":1739,"количестве":1740,"пропускается":1741,"функцию":1742,"получается":1743,"целое":1744,"число":1745,"которому":1746,"определяется":1747,"ячейка":1748,"лежать":1749,"элемент":1750,"функция":1751,"gethashcode":1752,"определённый":1753,"ключа":1754,"два":1755,"получить":1756,"тот":1757,"коллизия":1758,"цепочка":1759,"индексы":1760,"entry":1761,"потому":1762,"достижении":1763,"создаётся":1764,"копируются":1765,"медленным":1766,"порядке":1767,"совпадающем":1768,"дыры":1769,"удалений":1770,"занимает":1771,"дополнительные":1772,"чтения":1773,"cpu":1774,"эффективно":1775,"предсказывать":1776,"кэшировать":1777,"адреса":1778,"высокая":1779,"readonly":1780,"equals":1781,"vector3int":1782,"boxing":1783,"процесс":1784,"преобразования":1785,"значимого":1786,"значения":1787,"type":1788,"ссылочный":1789,"unboxing":1790,"обратное":1791,"преобразование":1792,"обратно":1793,"потенциальное":1794,"падение":1795,"вызываемых":1796,"методах":1797,"ongui":1798,"приводится":1799,"интерфейсу":1800,"реализует":1801,"boxed":1802,"кладётся":1803,"кучу":1804,"heap":1805,"обёрнутую":1806,"оригинальное":1807,"стеке":1808,"извлечение":1809,"явного":1810,"приведения":1811,"копирует":1812,"стек":1813,"неверен":1814,"будет":1815,"invalidcastexception":1816,"возникает":1817,"незаметно":1818,"передаче":1819,"принимающий":1820,"tostring":1821,"логировании":1822,"pos":1823,"myvector3":1824,"добавлении":1825,"ienumerable":1826,"imyinterface":1827,"my":1828,"mystruct":1829,"аллоцируемая":1830,"созданию":1831,"нового":1832,"мусор":1833,"убирать":1834,"статтеры":1835,"лаги":1836,"фризы":1837,"мобилках":1838,"незаметным":1839,"повторяться":1840,"каждую":1841,"frame":1842,"скрытые":1843,"утечки":1844,"toolkit":1845,"кэширования":1846,"десятки":1847,"секунду":1848,"обобщения":1849,"generics":1850,"вызывают":1851,"csharp":1852,"copyedit":1853,"void":1854,"valuetype":1855,"перфрейм":1856,"коде":1857,"возможности":1858,"специальные":1859,"адаптеры":1860,"прочее":1861,"вызывать":1862,"выделить":1863,"адаптер":1864,"generic":1865,"избегают":1866,"генерирует":1867,"метода":1868,"узнать":1869,"смотри":1870,"il":1871,"используй":1872,"профайлер":1873,"profiler":1874,"jetbrains":1875,"dottrace":1876,"отследить":1877,"spikes":1878,"unbox":1879,"ить":1880,"неверный":1881,"underlying":1882,"был":1883,"совместим":1884,"q6":1885,"точно":1886,"приведение":1887,"params":1888,"вызов":1889,"виртуальных":1890,"стандарт":1891,"построена":1892,"платформа":1893,"clr":1894,"microsoft":1895,"компилируется":1896,"промежуточный":1897,"язык":1898,"запуска":1899,"преобразуется":1900,"jit":1901,"компилятором":1902,"машинный":1903,"среды":1904,"common":1905,"language":1906,"infrastructure":1907,"спецификация":1908,"ecma":1909,"iso":1910,"описывающая":1911,"работать":1912,"включает":1913,"типовую":1914,"исполнения":1915,"безопасность":1916,"p":1917,"invoke":1918,"переносимые":1919,"исполняемые":1920,"mono":1921,"конкретная":1922,"выполнением":1923,"программ":1924,"компиляция":1925,"сборка":1926,"мусора":1927,"межъязыковая":1928,"запускает":1929,"intermediate":1930,"cil":1931,"байткод":1932,"языки":1933,"независим":1934,"скомпилирован":1935,"любую":1936,"just":1937,"берет":1938,"компилирует":1939,"конкретную":1940,"платформу":1941,"x64":1942,"учитывать":1943,"задержки":1944,"первом":1945,"вызове":1946,"включающая":1947,"библиотеки":1948,"bcl":1949,"компиляторы":1950,"roslyn":1951,"бывает":1952,"устарел":1953,"современное":1954,"компилировать":1955,"переносимый":1956,"формат":1957,"одинаково":1958,"понятный":1959,"платформ":1960,"облегчает":1961,"кроссплатформенность":1962,"преобразует":1963,"оптимизировать":1964,"обычный":1965,"il2cpp":1966,"проекты":1967,"компилируются":1968,"aot":1969,"запрещён":1970,"заменить":1971,"да":1972,"coreclr":1973,"ты":1974,"можешь":1975,"написать":1976,"свою":1977,"myunity":1978,"d1":1979,"81":1980,"82":1981,"80":1982,"83":1983,"d0":1984,"ba":1985,"8b":1986,"b4":1987,"b0":1988,"bd":1989,"85":1990,"набор":1991,"значений":1992,"идентифицируемых":1993,"stack":1994,"организованных":1995,"lifo":1996,"last":1997,"first":1998,"out":1999,"последний":2000,"пришел":2001,"вышел":2002,"столбик":2003,"стопка":2004,"отложенные":2005,"пользователь":2006,"тапает":2007,"персонажу":2008,"занят":2009,"освободится":2010,"нам":2011,"важна":2012,"последнем":2013,"самом":2014,"актуальном":2015,"тапе":2016,"вершину":2017,"pop":2018,"вершины":2019,"peek":2020,"возвращение":2021,"очередь":2022,"fifo":2023,"начала":2024,"enqueue":2025,"dequeue":2026,"связный":2027,"связанных":2028,"узлов":2029,"хранятся":2030,"следующий":2031,"двусвязный":2032,"связанный":2033,"хранится":2034,"предыдущий":2035,"делегат":2036,"представляющий":2037,"определённой":2038,"сигнатурой":2039,"action":2040,"func":2041,"обобщённые":2042,"типы":2043,"делегатов":2044,"возвращает":2045,"активно":2046,"колбэков":2047,"событий":2048,"асинхронных":2049,"загрузки":2050,"пр":2051,"чётко":2052,"сигнатуру":2053,"делегата":2054,"область":2055,"отписки":2056,"способный":2057,"соответствует":2058,"сигнатуре":2059,"аргументы":2060,"возвращаемое":2061,"delegate":2062,"damagehandler":2063,"amount":2064,"объявление":2065,"takedamage":2066,"dmg":2067,"hp":2068,"handler":2069,"мультикаст":2070,"объединять":2071,"будут":2072,"вызываться":2073,"очереди":2074,"return":2075,"сохраняется":2076,"результат":2077,"последнего":2078,"вызванного":2079,"наличии":2080,"точной":2081,"аргумент":2082,"t1":2083,"t2":2084,"параметров":2085,"tresult":2086,"сначала":2087,"конце":2088,"повсеместно":2089,"button":2090,"onclick":2091,"addlistener":2092,"unityaction":2093,"multicastdelegate":2094,"dotween":2095,"oncomplete":2096,"onkill":2097,"onstepcomplete":2098,"tweencallback":2099,"ondamagetaken":2100,"custom":2101,"callbacks":2102,"dosomething":2103,"ondone":2104,"ссылочные":2105,"переменных":2106,"передавать":2107,"сравнивать":2108,"null":2109,"nullreferenceexception":2110,"проверяй":2111,"альтернативу":2112,"лямбде":2113,"garbage":2114,"collected":2115,"сам":2116,"держишь":2117,"них":2118,"мультикасте":2119,"возвращается":2120,"обработчика":2121,"vs":2122,"переменная":2123,"присвоить":2124,"очистить":2125,"возможен":2126,"изнутри":2127,"механизм":2128,"сигнал":2129,"событии":2130,"сигналов":2131,"onsomething":2132,"подписки":2133,"инвертированного":2134,"doafterdelay":2135,"callback":2136,"запрещающее":2137,"внешнее":2138,"присваивание":2139,"подписчиков":2140,"проверять":2141,"отписать":2142,"лямбду":2143,"лямбда":2144,"анонимная":2145,"неотписываема":2146,"несколько":2147,"игнорируются":2148,"порядку":2149,"отличный":2150,"плагиноподобных":2151,"систем":2152,"преимущество":2153,"обычным":2154,"методом":2155,"передать":2156,"повышает":2157,"модульность":2158,"enum":2159,"битовые":2160,"маски":2161,"применяют":2162,"обычного":2163,"подводные":2164,"камни":2165,"способ":2166,"именованные":2167,"представляющие":2168,"одного":2169,"сочетании":2170,"атрибутом":2171,"битовая":2172,"маска":2173,"позволяя":2174,"комбинировать":2175,"множество":2176,"флагов":2177,"переменной":2178,"побитовые":2179,"одновременно":2180,"системах":2181,"доступов":2182,"layermask":2183,"movementtype":2184,"walk":2185,"jump":2186,"капотом":2187,"целочисленные":2188,"фиксированного":2189,"набора":2190,"movementflags":2191,"none":2192,"0001":2193,"0010":2194,"0100":2195,"fly":2196,"перечисления":2197,"представляют":2198,"биты":2199,"combined":2200,"0101":2201,"проверка":2202,"наличия":2203,"флага":2204,"if":2205,"именно":2206,"степени":2207,"двойки":2208,"двоичном":2209,"представлении":2210,"уникальным":2211,"битом":2212,"произойдут":2213,"невозможно":2214,"понять":2215,"там":2216,"атрибут":2217,"влияет":2218,"добавляет":2219,"удобное":2220,"строковое":2221,"console":2222,"writeline":2223,"9":2224,"битовых":2225,"масок":2226,"компактность":2227,"штук":2228,"long":2229,"64":2230,"hideflags":2231,"eventmodifiers":2232,"кастомные":2233,"системные":2234,"флаги":2235,"неиспользуемые":2236,"которого":2237,"вернёт":2238,"combinedvalue":2239,"еще":2240,"явно":2241,"задавать":2242,"пустого":2243,"масштабируются":2244,"динамически":2245,"рантайме":2246,"сериализует":2247,"выглядят":2248,"сериализовать":2249,"удобным":2250,"инспекторе":2251,"кастомный":2252,"propertydrawer":2253,"odin":2254,"битовый":2255,"mask":2256,"layerindex":2257,"произойдет":2258,"задать":2259,"флагам":2260,"забыть":2261,"автоприсвоены":2262,"побитовая":2263,"сломается":2264,"начнут":2265,"конфликтовать":2266,"debuggerdisplay":2267,"нечитабельны":2268,"обязателен":2269,"желателен":2270,"проверяет":2271,"точное":2272,"совпадение":2273,"битов":2274,"установлен":2275,"false":2276,"флагом":2277,"флагами":2278,"умолчанию":2279,"свой":2280,"битовыми":2281,"чекбоксами":2282,"аналогами":2283,"языках":2284,"встречается":2285,"многих":2286,"включая":2287,"rust":2288,"swift":2289,"наличие":2290,"аналогов":2291,"конкретного":2292,"языка":2293,"сборщик":2294,"значимые":2295,"очищаются":2296,"размещаются":2297,"удаляются":2298,"поколениям":2299,"gen":2300,"запускается":2301,"мере":2302,"нехватке":2303,"приостанавливать":2304,"выполнение":2305,"потока":2306,"pause":2307,"встроенный":2308,"виртуальной":2309,"машины":2310,"отвечающий":2311,"автоматическое":2312,"сборках":2313,"backend":2314,"boehm":2315,"сгенерированный":2316,"контексте":2317,"признак":2318,"значимый":2319,"очистка":2320,"выходе":2321,"области":2322,"видимости":2323,"выделения":2324,"аллокация":2325,"reference":2326,"types":2327,"момент":2328,"строит":2329,"граф":2330,"достижимости":2331,"корневых":2332,"статические":2333,"регистры":2334,"помечает":2335,"дотянуться":2336,"считаются":2337,"мусором":2338,"удалены":2339,"фаз":2340,"mark":2341,"находит":2342,"достижимые":2343,"sweep":2344,"удаляет":2345,"мусорные":2346,"compact":2347,"перемещает":2348,"выжившие":2349,"устранить":2350,"фрагментацию":2351,"поколения":2352,"разделяет":2353,"поколение":2354,"описание":2355,"частая":2356,"пережившие":2357,"промежуточная":2358,"зона":2359,"долго":2360,"живущие":2361,"редкая":2362,"тяжёлая":2363,"loh":2364,"large":2365,"кб":2366,"перемещаются":2367,"чистятся":2368,"выживший":2369,"продвигается":2370,"тем":2371,"реже":2372,"срабатывает":2373,"определённым":2374,"условиям":2375,"хватает":2376,"свободной":2377,"превысило":2378,"лимит":2379,"allocation":2380,"budget":2381,"выросло":2382,"прямом":2383,"collect":2384,"остановка":2385,"визуальные":2386,"сборку":2387,"следует":2388,"крайней":2389,"паузу":2390,"блокировку":2391,"адаптивного":2392,"финализаторами":2393,"tools":2394,"бенчмарков":2395,"точек":2396,"явной":2397,"очистки":2398,"финализаторы":2399,"idisposable":2400,"подход":2401,"финализатор":2402,"classname":2403,"вызывается":2404,"удалением":2405,"увеличивает":2406,"нагрузку":2407,"отложенное":2408,"dispose":2409,"using":2410,"контролируемый":2411,"быстрый":2412,"финализации":2413,"освобождения":2414,"неуправляемых":2415,"ресурсов":2416,"потоки":2417,"хендлы":2418,"практики":2419,"полезно":2420,"избегает":2421,"частых":2422,"кадре":2423,"снижает":2424,"частоту":2425,"pool":2426,"готовые":2427,"destroy":2428,"очищает":2429,"новой":2430,"string":2431,"лишние":2432,"временные":2433,"упаковки":2434,"финализатора":2435,"освобождение":2436,"задержек":2437,"профайлеры":2438,"находить":2439,"устранять":2440,"избыточные":2441,"скрытых":2442,"enumerator":2443,"лямбды":2444,"замыкания":2445,"создают":2446,"выделением":2447,"полезные":2448,"вкладка":2449,"alloc":2450,"кадровые":2451,"memory":2452,"retained":2453,"objects":2454,"дерево":2455,"дубликаты":2456,"gettotalmemory":2457,"текущий":2458,"выделенной":2459,"объектом":2460,"выходит":2461,"пока":2462,"него":2463,"удалён":2464,"сборщиком":2465,"идёт":2466,"упаковывается":2467,"финализаторов":2468,"вызываются":2469,"задержкой":2470,"блокируют":2471,"увеличивают":2472,"произойдёт":2473,"приведении":2474,"упакуется":2475,"выделенный":2476,"мешает":2477,"внутренней":2478,"редко":2479,"выигрыш":2480,"q7":2481,"выживает":2482,"нескольких":2483,"проходов":2484,"считается":2485,"долгоживущим":2486,"переносится":2487,"следующее":2488,"описывает":2489,"контракт":2490,"допускает":2491,"множественную":2492,"определяет":2493,"свойств":2494,"индексаторов":2495,"возможна":2496,"default":2497,"полей":2498,"описания":2499,"независимо":2500,"члены":2501,"реализованные":2502,"наследуется":2503,"общей":2504,"частичной":2505,"обобщённого":2506,"наследовать":2507,"этом":2508,"attack":2509,"ireloadable":2510,"reload":2511,"gun":2512,"требований":2513,"структуре":2514,"индексаторы":2515,"реализующий":2516,"абстрактным":2517,"классом":2518,"неоднозначностей":2519,"множественным":2520,"методами":2521,"явная":2522,"ifoo":2523,"do":2524,"ibar":2525,"конфликтуют":2526,"предоставить":2527,"базовую":2528,"выдаст":2529,"ошибку":2530,"объявлен":2531,"базовом":2532,"классе":2533,"hashset":2534,"linkedlist":2535,"устроены":2536,"коллекции":2537,"реализуют":2538,"обычные":2539,"совместимы":2540,"burst":2541,"характеру":2542,"уникальности":2543,"уникальность":2544,"совместима":2545,"jobs":2546,"кольцевой":2547,"буфер":2548,"конца":2549,"узлу":2550,"извлекает":2551,"очередей":2552,"пула":2553,"q":2554,"item":2555,"простых":2556,"реальном":2557,"времени":2558,"кольцевые":2559,"nativequeue":2560,"кладёт":2561,"сверху":2562,"снимает":2563,"верхний":2564,"алгоритмах":2565,"обхода":2566,"dfs":2567,"откатов":2568,"second":2569,"val":2570,"полезен":2571,"back":2572,"меню":2573,"внимания":2574,"аллокациям":2575,"linkedlistnode":2576,"списков":2577,"частыми":2578,"удалениями":2579,"вставками":2580,"ссылке":2581,"node":2582,"addlast":2583,"addafter":2584,"15":2585,"точки":2586,"зрения":2587,"кэша":2588,"уникальных":2589,"благодаря":2590,"pathfinding":2591,"кэшах":2592,"set":2593,"contains":2594,"true":2595,"отлично":2596,"фильтрации":2597,"дубликатов":2598,"главное":2599,"помнить":2600,"горячих":2601,"путях":2602,"iequatable":2603,"выбрать":2604,"задача":2605,"рекомендуемая":2606,"redo":2607,"фильтрация":2608,"высоконагруженный":2609,"реальный":2610,"геймплей":2611,"кастомная":2612,"collections":2613,"применим":2614,"unmanaged":2615,"собственную":2616,"кольцевого":2617,"буфера":2618,"пустой":2619,"бросится":2620,"исключение":2621,"invalidoperationexception":2622,"_почему":2623,"хотя":2624,"тоже":2625,"addfirst":2626,"removefirst":2627,"массивах":2628,"узел":2629,"неизменяемый":2630,"immutable":2631,"фактически":2632,"синоним":2633,"любая":2634,"stringbuilder":2635,"буферизированный":2636,"изменяемый":2637,"эффективной":2638,"лишних":2639,"format":2640,"интерполяции":2641,"ключевое":2642,"слово":2643,"полностью":2644,"взаимозаменяемы":2645,"sealed":2646,"char":2647,"icomparable":2648,"др":2649,"операторы":2650,"substring":2651,"replace":2652,"split":2653,"toupper":2654,"интернируются":2655,"abc":2656,"ссылаться":2657,"дизайну":2658,"безопасности":2659,"упрощения":2660,"хэширования":2661,"кеширования":2662,"предсказуемость":2663,"изменяемыми":2664,"строку":2665,"могла":2666,"повлиять":2667,"другую":2668,"часть":2669,"immutability":2670,"исключает":2671,"side":2672,"effects":2673,"ещё":2674,"поскольку":2675,"изменяются":2676,"безопасно":2677,"экономит":2678,"ускоряет":2679,"вплоть":2680,"потокобезопасность":2681,"свободно":2682,"потоками":2683,"блокировок":2684,"хэш":2685,"таблиц":2686,"закешировать":2687,"опасаясь":2688,"строка":2689,"изменится":2690,"нарушит":2691,"целостность":2692,"простота":2693,"api":2694,"логично":2695,"сюрпризов":2696,"копировании":2697,"сравнении":2698,"изменение":2699,"интерполяция":2700,"for":2701,"копируется":2702,"заново":2703,"логирование":2704,"тексты":2705,"источники":2706,"text":2707,"позволяющий":2708,"накапливать":2709,"создания":2710,"append":2711,"appendformat":2712,"расширяющийся":2713,"значительно":2714,"циклах":2715,"массовых":2716,"преобразованиях":2717,"циклическая":2718,"массивная":2719,"конкатенация":2720,"генерация":2721,"логов":2722,"текстов":2723,"формирование":2724,"вне":2725,"layout":2726,"html":2727,"csv":2728,"дебаг":2729,"дампов":2730,"прочего":2731,"отсутствие":2732,"низкая":2733,"сборке":2734,"thread":2735,"safe":2736,"максимум":2737,"явных":2738,"ничем":2739,"языковое":2740,"оба":2741,"указывают":2742,"строками":2743,"цикле":2744,"создаются":2745,"старые":2746,"уходят":2747,"накапливаются":2748,"значит":2749,"компиляции":2750,"одинаковые":2751,"строковые":2752,"литералы":2753,"удобен":2754,"операциях":2755,"множественной":2756,"конкатенации":2757,"результаты":2758,"форматирования":2759,"enemy":2760,"boss":2761,"finalboss":2762,"базовые":2763,"понятия":2764,"которая":2765,"важное":2766,"меняется":2767,"таким":2768,"образом":2769,"мы":2770,"храним":2771,"имеем":2772,"типом":2773,"две":2774,"другая":2775,"upcasting":2776,"восходящее":2777,"определение":2778,"дочернего":2779,"родительскому":2780,"меняет":2781,"доступны":2782,"является":2783,"rigidbody":2784,"rb":2785,"gameobject":2786,"getcomponent":2787,"_твоя":2788,"добавь":2789,"своей":2790,"игры":2791,"quizrpg":2792,"vm":2793,"базовому":2794,"типу":2795,"_чтобы":2796,"закрепить":2797,"вставь":2798,"одно":2799,"своё":2800,"предложение":2801,"объясняющее":2802,"непосредственно":2803,"объявлены":2804,"присваивании":2805,"копия":2806,"собой":2807,"размещённый":2808,"управляемой":2809,"числе":2810,"хранение":2811,"inline":2812,"nullable":2813,"примитивы":2814,"byte":2815,"short":2816,"double":2817,"decimal":2818,"bool":2819,"обёртки":2820,"ограниченный":2821,"размеру":2822,"хранит":2823,"локальные":2824,"переменные":2825,"значимых":2826,"типов":2827,"очищается":2828,"управляется":2829,"экземпляров":2830,"ссылочных":2831,"collector":2832,"point":2833,"x":2834,"y":2835,"line":2836,"start":2837,"end":2838,"встроен":2839,"поле":2840,"находиться":2841,"вместе":2842,"этим":2843,"представлять":2844,"переданный":2845,"ref":2846,"копирование":2847,"получит":2848,"оригинал":2849,"происходить":2850,"этой":2851,"копией":2852,"затронут":2853,"исходный":2854,"ряде":2855,"случаев":2856,"байт":2857,"чрезмерное":2858,"нивелировать":2859,"выгоду":2860,"реализуемому":2861,"атрибуты":2862,"системными":2863,"пользовательскими":2864,"атрибутами":2865,"уровне":2866,"метаданных":2867,"навешивать":2868,"внедрять":2869,"информацию":2870,"обрабатываемую":2871,"рефлексией":2872,"системой":2873,"инспектора":2874,"serializefield":2875,"runtimeinitializeonloadmethod":2876,"сериализации":2877,"собственных":2878,"тулов":2879,"экземпляр":2880,"наследующегося":2881,"attribute":2882,"стандартные":2883,"obsolete":2884,"serializable":2885,"dllimport":2886,"специфичные":2887,"contextmenu":2888,"executealways":2889,"пользовательские":2890,"обрабатывая":2891,"рефлексию":2892,"простого":2893,"кастомного":2894,"атрибута":2895,"attributeusage":2896,"attributetargets":2897,"custominfoattribute":2898,"info":2899,"get":2900,"memberinfo":2901,"getcustomattributes":2902,"getcustomattribute":2903,"назначение":2904,"инспектор":2905,"tooltip":2906,"range":2907,"requirecomponent":2908,"disallowmultiplecomponent":2909,"инициализация":2910,"initializeonloadmethod":2911,"редактор":2912,"menuitem":2913,"customeditor":2914,"механика":2915,"рефлексии":2916,"inherited":2917,"allowmultiple":2918,"многие":2919,"анализируются":2920,"этапе":2921,"редактора":2922,"serializedobject":2923,"monoimporter":2924,"editorapplication":2925,"влияют":2926,"тех":2927,"обрабатываются":2928,"самим":2929,"специфика":2930,"заставляет":2931,"приватное":2932,"awake":2933,"редакторе":2934,"кнопку":2935,"объекте":2936,"_кастомный":2937,"пайплайн":2938,"сериализации_":2939,"независимый":2940,"поэтому":2941,"равнозначны":2942,"сериализуется":2943,"видно":2944,"инкапсуляцию":2945,"сериализацию":2946,"сохраняя":2947,"инициализации":2948,"синглтонов":2949,"регистраций":2950,"полям":2951,"mycustomvalidation":2952,"навесить":2953,"атрибутов":2954,"понимает":2955,"парсит":2956,"итераторы":2957,"ienumerator":2958,"yield":2959,"связано":2960,"производительностью":2961,"итератор":2962,"предоставляющий":2963,"поэлементный":2964,"последовательности":2965,"внутреннюю":2966,"структуру":2967,"определить":2968,"ленивую":2969,"последовательность":2970,"определяющие":2971,"коллекциям":2972,"перечислителю":2973,"проходить":2974,"элементам":2975,"другим":2976,"скрывают":2977,"упрощая":2978,"написание":2979,"ленивых":2980,"потоковых":2981,"коллекций":2982,"временных":2983,"пройти":2984,"getenumerator":2985,"movenext":2986,"current":2987,"reset":2988,"современный":2989,"дженерики":2990,"безопаснее":2991,"типам":2992,"поддерживают":2993,"linq":2994,"разбить":2995,"превращает":2996,"machine":2997,"кулисами":2998,"скрытый":2999,"переход":3000,"новое":3001,"generate":3002,"ленивый":3003,"запроса":3004,"бесконечными":3005,"последовательностями":3006,"большим":3007,"объёмом":3008,"допустимые":3009,"конструкции":3010,"expr":3011,"вернуть":3012,"break":3013,"завершить":3014,"перечисление":3015,"досрочно":3016,"try":3017,"finally":3018,"catch":3019,"анонимных":3020,"функциях":3021,"this":3022,"оператор":3023,"запрашивает":3024,"берёт":3025,"поддерживающий":3026,"именами":3027,"промежуточных":3028,"эффективна":3029,"работа":3030,"фильтрацией":3031,"трансформацией":3032,"where":3033,"select":3034,"rewind":3035,"обращаться":3036,"отлаживать":3037,"индекс":3038,"текущим":3039,"положением":3040,"полями":3041,"ожидает":3042,"явную":3043,"именем":3044,"бесконечный":3045,"while":3046,"генераторы":3047,"шум":3048,"окончания":3049,"возвращать":3050,"неопределён":3051,"выбросить":3052,"параметра":3053,"выходной":3054,"параметр":3055,"обязательна":3056,"методе":3057,"вариантность":3058,"ковариация":3059,"контравариация":3060,"обобщённых":3061,"интерфейсах":3062,"делегатах":3063,"возвращаемый":3064,"производным":3065,"принимаемый":3066,"базовым":3067,"modify":3068,"аналог":3069,"указателей":3070,"исходной":3071,"tryparse":3072,"result":3073,"обязан":3074,"завершения":3075,"побочным":3076,"результатом":3077,"парсинг":3078,"передает":3079,"гарантирует":3080,"неизменность":3081,"крупных":3082,"matrix4x4":3083,"ray":3084,"ситуаций":3085,"гарантировать":3086,"передаются":3087,"мелких":3088,"vector2":3089,"эффективнее":3090,"копии":3091,"упаковка":3092,"iinterface":3093,"передается":3094,"математических":3095,"вычислений":3096,"dots":3097,"оптимальное":3098,"calculate":3099,"sqrmagnitude":3100,"неэффективные":3101,"случаи":3102,"print":3103,"number":3104,"мелкая":3105,"process":3106,"m":3107,"externalmethod":3108,"создаст":3109,"рефлексия":3110,"получения":3111,"информации":3112,"типах":3113,"ими":3114,"существенно":3115,"почти":3116,"применение":3117,"контейнерах":3118,"кастомной":3119,"инструментах":3120,"анализировать":3121,"объектами":3122,"fieldinfo":3123,"methodinfo":3124,"constructorinfo":3125,"имени":3126,"знания":3127,"медленная":3128,"оптимизации":3129,"встроить":3130,"проанализировать":3131,"пути":3132,"inlining":3133,"структурам":3134,"упаковку":3135,"распаковку":3136,"compilation":3137,"инструкций":3138,"инструкция":3139,"интерпретатора":3140,"маршалинг":3141,"защита":3142,"каждым":3143,"вызовом":3144,"корректности":3145,"замерам":3146,"прямого":3147,"существенная":3148,"просадка":3149,"обработке":3150,"небезопасность":3151,"обойти":3152,"сломать":3153,"неочевидный":3154,"типовой":3155,"ошибки":3156,"линкером":3157,"имён":3158,"вырезаны":3159,"указаны":3160,"link":3161,"xml":3162,"фреймворках":3163,"аналогичные":3164,"фреймворки":3165,"причины":3166,"автоматизация":3167,"boilerplate":3168,"искать":3169,"авто":3170,"инжектить":3171,"сканировать":3172,"поддержка":3173,"инъекций":3174,"приватные":3175,"существующего":3176,"режим":3177,"кеширует":3178,"полученные":3179,"запуске":3180,"загрузке":3181,"похожие":3182,"сохранения":3183,"injectattribute":3184,"concreteidbinder":3185,"scriptableobjectinstaller":3186,"вырезания":3187,"автоинспекторов":3188,"генерации":3189,"форм":3190,"дебага":3191,"сериализаторов":3192,"старте":3193,"разовых":3194,"служебных":3195,"задачах":3196,"логгинг":3197,"автоскан":3198,"разбор":3199,"любых":3200,"fixedupdate":3201,"ontriggerenter":3202,"перемещении":3203,"гарантированно":3204,"сохранены":3205,"абстракцию":3206,"медленно":3207,"аргументов":3208,"интерпретатор":3209,"несмотря":3210,"медлительность":3211,