{"":0,"использование":1,"памяти":2,"в":3,"unity":4,"memory":5,"heap":6,"как":7,"и":8,"во":9,"многих":10,"средах":11,"на":12,"базе":13,"c":14,"управление":15,"памятью":16,"делится":17,"работу":18,"со":19,"стеком":20,"stack":21,"кучей":22,"это":23,"область":24,"выделяемая":25,"для":26,"хранения":27,"объектов":28,"динамически":29,"создаваемых":30,"время":31,"выполнения":32,"отличие":33,"от":34,"стека":35,"где":36,"память":37,"выделяется":38,"освобождается":39,"автоматически":40,"при":41,"входе":42,"выходе":43,"из":44,"методов":45,"куче":46,"управляется":47,"вручную":48,"или":49,"с":50,"помощью":51,"сборщика":52,"мусора":53,"контексте":54,"почти":55,"все":56,"объекты":57,"создаваемые":58,"new":59,"включая":60,"пользовательские":61,"классы":62,"строки":63,"списки":64,"т":65,"д":66,"размещаются":67,"куча":68,"два":69,"основных":70,"сегмента":71,"managed":72,"управляемая":73,"через":74,"net":75,"native":76,"нативная":77,"используемая":78,"движком":79,"напрямую":80,"например":81,"текстур":82,"мешей":83,"ассетов":84,"когда":85,"говорят":86,"о":87,"производительности":88,"чаще":89,"всего":90,"имеют":91,"виду":92,"именно":93,"так":94,"она":95,"подвержена":96,"сборке":97,"garbage":98,"collection":99,"gc":100,"которая":101,"может":102,"вызывать":103,"лаги":104,"просадки":105,"fps":106,"сборка":107,"используется":108,"ссылочных":109,"типов":110,"классов":111,"массивов":112,"строк":113,"делегатов":114,"значимые":115,"типы":116,"struct":117,"int":118,"float":119,"п":120,"по":121,"умолчанию":122,"стеке":123,"но":124,"если":125,"они":126,"вложены":127,"класс":128,"захвачены":129,"замыканием":130,"также":131,"могут":132,"попасть":133,"кучу":134,"проблема":135,"возникает":136,"создаётся":137,"много":138,"временных":139,"приводит":140,"к":141,"выделению":142,"который":143,"затем":144,"должен":145,"быть":146,"очищен":147,"сборщиком":148,"csharp":149,"void":150,"update":151,"list":152,"string":153,"temp":154,"каждый":155,"кадр":156,"add":157,"hello":158,"выходит":159,"области":160,"видимости":161,"объект":162,"остаётся":163,"до":164,"такой":165,"код":166,"приведёт":167,"постоянному":168,"что":169,"вызовет":170,"частые":171,"запуски":172,"особенно":173,"мобильных":174,"устройствах":175,"процесс":176,"стоп":177,"мира":178,"stop":179,"the":180,"world":181,"потоки":182,"приостанавливаются":183,"вызвать":184,"заметные":185,"задержки":186,"оптимизация":187,"использования":188,"кучи":189,"минимизации":190,"нагрузки":191,"следует":192,"придерживаться":193,"следующих":194,"практик":195,"избегать":196,"выделения":197,"методах":198,"fixedupdate":199,"не":200,"создавать":201,"новые":202,"использовать":203,"объектные":204,"пулы":205,"вместо":206,"создания":207,"уничтожения":208,"пулей":209,"частиц":210,"переиспользовать":211,"уже":212,"выделенные":213,"кэшировать":214,"ссылки":215,"частого":216,"вызова":217,"getcomponent":218,"transform":219,"сохраните":220,"ссылку":221,"старте":222,"private":223,"cachedtransform":224,"start":225,"stringbuilder":226,"конкатенации":227,"неизменяемы":228,"каждая":229,"конкатенация":230,"создаёт":231,"новый":232,"предпочитать":233,"классам":234,"уместно":235,"данных":236,"без":237,"поведения":238,"структуры":239,"упакованы":240,"boxed":241,"мониторинг":242,"инструменты":243,"предоставляет":244,"мощные":245,"анализа":246,"profiler":247,"window":248,"analysis":249,"позволяет":250,"отслеживать":251,"выделение":252,"кадрам":253,"видеть":254,"какие":255,"методы":256,"вызывают":257,"аллокации":258,"package":259,"расширенный":260,"инструмент":261,"позволяющий":262,"делать":263,"снимки":264,"snapshots":265,"состояния":266,"анализировать":267,"утечки":268,"просматривать":269,"deep":270,"profiling":271,"включает":272,"детальную":273,"трассировку":274,"показывает":275,"коде":276,"происходит":277,"пример":278,"профилирования":279,"1":280,"запустите":281,"игру":282,"редакторе":283,"2":284,"откройте":285,"3":286,"перейдите":287,"вкладку":288,"4":289,"обратите":290,"внимание":291,"кривую":292,"alloc":293,"растёт":294,"есть":295,"аллокациями":296,"долгоживущие":297,"распространённая":298,"ошибка":299,"за":300,"неправильных":301,"ссылок":302,"подписка":303,"события":304,"отписки":305,"onenable":306,"someevent":307,"onhappened":308,"handleevent":309,"утечка":310,"отписаться":311,"ondisable":312,"обязательно":313,"отписываться":314,"уничтожён":315,"него":316,"всё":317,"ещё":318,"активные":319,"статических":320,"событий":321,"корутин":322,"сборщик":323,"сможет":324,"его":325,"удалить":326,"останется":327,"занятой":328,"заключение":329,"эффективное":330,"ключ":331,"стабильной":332,"слабых":333,"основная":334,"цель":335,"минимизировать":336,"критических":337,"участках":338,"кода":339,"понимание":340,"различий":341,"между":342,"профилировщиков":343,"соблюдение":344,"лучших":345,"позволяют":346,"избежать":347,"частых":348,"сборок":349,"утечек":350,"любом":351,"приложении":352,"типа":353,"стек":354,"разницы":355,"ними":356,"критически":357,"важно":358,"оптимизации":359,"предотвращения":360,"локальных":361,"переменных":362,"а":363,"динамического":364,"под":365,"ключевого":366,"слова":367,"большинство":368,"производных":369,"monobehaviour":370,"scriptableobject":371,"любые":372,"созданные":373,"такое":374,"жизни":375,"которых":376,"неизвестно":377,"этапе":378,"компиляции":379,"соответственно":380,"осуществляется":381,"collector":382,"создаются":383,"них":384,"после":385,"того":386,"становятся":387,"недостижимыми":388,"больше":389,"нет":390,"помечаются":391,"мусор":392,"освобождает":393,"следующей":394,"проблемы":395,"начинаются":396,"слишком":397,"частым":398,"сборкам":399,"collect":400,"которые":401,"вызов":402,"tostring":403,"создание":404,"анонимных":405,"linq":406,"осторожности":407,"незаметно":408,"генерировать":409,"встроенные":410,"можно":411,"включить":412,"запись":413,"посмотреть":414,"каких":415,"происходят":416,"вкладка":417,"общий":418,"объём":419,"выделенной":420,"режиме":421,"detailed":422,"конкретные":423,"их":424,"размер":425,"полезна":426,"опция":427,"record":428,"allocations":429,"доступен":430,"manager":431,"даёт":432,"более":433,"глубокий":434,"анализ":435,"отслеживание":436,"типам":437,"сравнение":438,"снимков":439,"удерживающих":440,"удаления":441,"помогает":442,"находить":443,"подписки":444,"событие":445,"которое":446,"никто":447,"отписывает":448,"практические":449,"рекомендации":450,"снижению":451,"аллокаций":452,"кэширование":453,"избегайте":454,"вызовов":455,"вроде":456,"t":457,"gameobject":458,"find":459,"camera":460,"main":461,"сохраняйте":462,"результат":463,"поле":464,"_cachedtransform":465,"position":466,"vector3":467,"up":468,"time":469,"deltatime":470,"циклах":471,"плохо":472,"массив":473,"var":474,"positions":475,"10":476,"хорошо":477,"кэшируем":478,"_positions":479,"используем":480,"используйте":481,"_sb":482,"clear":483,"append":484,"score":485,"textcomponent":486,"text":487,"аллоцирует":488,"реже":489,"горячем":490,"where":491,"select":492,"создают":493,"временные":494,"enemies":495,"findobjectsoftype":496,"enemy":497,"e":498,"isactive":499,"tolist":500,"лучше":501,"цикл":502,"allenemies":503,"activeenemies":504,"foreach":505,"in":506,"if":507,"5":508,"ref":509,"span":510,"2021":511,"работы":512,"данными":513,"вычислительно":514,"сложных":515,"задачах":516,"генерация":517,"производительность":518,"мир":519,"операция":520,"очистки":521,"крупные":522,"фризы":523,"чтобы":524,"влияние":525,"старайтесь":526,"происходили":527,"вне":528,"инициализации":529,"загрузке":530,"сцены":531,"object":532,"pooling":533,"часто":534,"уничтожаемых":535,"пули":536,"эффекты":537,"неявных":538,"виртуальных":539,"упаковка":540,"значений":541,"boxing":542,"замыкания":543,"делегатах":544,"упаковки":545,"log":546,"value":547,"debug":548,"42":549,"упаковывается":550,"аллокация":551,"просто":552,"падать":553,"обеспечение":554,"плавной":555,"писать":556,"оптимизированный":557,"регулярное":558,"рефакторинг":559,"мусорного":560,"применение":561,"паттернов":562,"кэширования":563,"пулов":564,"созданию":565,"качественных":566,"приложений":567,"сложность":568,"алгоритмов":569,"основное":570,"кратко":571,"алгоритма":572,"быстро":573,"увеличении":574,"входных":575,"записывается":576,"o":577,"оценки":578,"сравнения":579,"используемые":580,"сложности":581,"обозначение":582,"название":583,"комментарий":584,"константная":585,"доступ":586,"индексу":587,"array":588,"i":589,"зависит":590,"размера":591,"входа":592,"n":593,"логарифмическая":594,"бинарный":595,"поиск":596,"отсортированном":597,"массиве":598,"делим":599,"каждом":600,"шаге":601,"линейная":602,"перебор":603,"всех":604,"элементов":605,"каждое":606,"значение":607,"смотрится":608,"один":609,"раз":610,"линейно":611,"логарифм":612,"быстрая":613,"сортировка":614,"merge":615,"sort":616,"оптимум":617,"сортировки":618,"сравнениями":619,"n²":620,"квадратичная":621,"вложенные":622,"циклы":623,"всеми":624,"деградирует":625,"росте":626,"2ⁿ":627,"экспоненциальная":628,"подмножеств":629,"комбинаторика":630,"практически":631,"оптимизаций":632,"визуальное":633,"роста":634,"30":635,"100":636,"7":637,"700":638,"000":639,"1000":640,"млн":641,"собеседованиях":642,"спрашивают":643,"q1":644,"почему":645,"работает":646,"делит":647,"пополам":648,"логарифмическое":649,"количество":650,"шагов":651,"q2":652,"ли":653,"улучшить":654,"сортировку":655,"быстрее":656,"чем":657,"основанных":658,"сравнениях":659,"теоретический":660,"предел":661,"q3":662,"опасны":663,"ведут":664,"выше":665,"критично":666,"больших":667,"объемах":668,"q4":669,"понимать":670,"давать":671,"микролаги":672,"q5":673,"поведение":674,"quadtree":675,"octree":676,"пространству":677,"отсортированных":678,"структурах":679,"таймеры":680,"буферы":681,"animator":682,"blend":683,"tree":684,"mask":685,"state":686,"machine":687,"подробный":688,"разбор":689,"машина":690,"состояний":691,"фундамент":692,"системы":693,"анимации":694,"направленный":695,"граф":696,"узлы":697,"представляют":698,"анимационные":699,"рёбра":700,"условия":701,"перехода":702,"ключевые":703,"entry":704,"exit":705,"точки":706,"выхода":707,"контроллера":708,"any":709,"переходить":710,"состояние":711,"любого":712,"места":713,"прерываний":714,"получение":715,"урона":716,"sub":717,"вложенная":718,"группировки":719,"логически":720,"связанных":721,"анимаций":722,"параметры":723,"переходов":724,"conditions":725,"логические":726,"проверки":727,"bool":728,"trigger":729,"срабатывает":730,"сбрасывается":731,"has":732,"включено":733,"переход":734,"произойдёт":735,"только":736,"завершения":737,"текущей":738,"fixed":739,"duration":740,"transition":741,"жёсткое":742,"автоматического":743,"расчёта":744,"write":745,"defaults":746,"true":747,"аниматор":748,"сбрасывает":749,"затронутые":750,"анимацией":751,"значениям":752,"отключайте":753,"работе":754,"аддитивными":755,"слоями":756,"кастомными":757,"утилитами":758,"древовидный":759,"смешиватель":760,"специальное":761,"интерполирует":762,"несколько":763,"основе":764,"числовых":765,"параметров":766,"идеален":767,"непрерывных":768,"движений":769,"режимы":770,"1d":771,"одна":772,"ось":773,"speed":774,"ходьба":775,"бег":776,"спринт":777,"2d":778,"две":779,"оси":780,"обычно":781,"direction":782,"8":783,"направлений":784,"freeform":785,"directional":786,"радиальное":787,"смешивание":788,"плавного":789,"поворота":790,"персонажа":791,"направлении":792,"настройка":793,"добавьте":794,"список":795,"задайте":796,"threshold":797,"порог":798,"активации":799,"включите":800,"automatic":801,"быстрого":802,"распределения":803,"motion":804,"привязки":805,"параметрам":806,"ограничения":807,"поддерживает":808,"сложные":809,"последовательности":810,"прерывания":811,"нелинейные":812,"переходы":813,"avatar":814,"маска":815,"аватара":816,"применять":817,"анимацию":818,"выбранному":819,"набору":820,"костей":821,"create":822,"редактируется":823,"визуальном":824,"назначается":825,"слою":826,"controller":827,"слои":828,"масками":829,"работают":830,"параллельно":831,"базовому":832,"порядок":833,"слоёв":834,"определяет":835,"приоритет":836,"верхний":837,"слой":838,"переопределяет":839,"нижний":840,"типичные":841,"сценарии":842,"разделение":843,"тела":844,"нижняя":845,"часть":846,"локомоция":847,"верхняя":848,"стрельба":849,"каст":850,"жесты":851,"руки":852,"ноги":853,"подбор":854,"предметов":855,"смена":856,"оружия":857,"анимация":858,"лица":859,"рта":860,"аддитивные":861,"наложение":862,"эмоций":863,"дыхания":864,"поверх":865,"базовой":866,"позы":867,"взаимодействие":868,"компонентов":869,"реальных":870,"проектах":871,"компоненты":872,"связке":873,"управляет":874,"логикой":875,"idle":876,"walk":877,"run":878,"attack":879,"внутри":880,"локомоции":881,"масштабирования":882,"скорости":883,"настраивается":884,"дополнительных":885,"слоях":886,"конфликтовала":887,"ногами":888,"критичен":889,"маской":890,"рук":891,"иметь":892,"базового":893,"слоя":894,"требуется":895,"полное":896,"переопределение":897,"параметрами":898,"переходами":899,"using":900,"unityengine":901,"public":902,"class":903,"playeranimator":904,"const":905,"speedparam":906,"isrunningparam":907,"isrunning":908,"attacktrigger":909,"h":910,"input":911,"getaxis":912,"horizontal":913,"v":914,"vertical":915,"vector2":916,"magnitude":917,"setfloat":918,"setbool":919,"0":920,"1f":921,"getbuttondown":922,"jump":923,"settrigger":924,"программный":925,"кроссфейдом":926,"playattackanimation":927,"fadetime":928,"2f":929,"crossfade":930,"attackstate":931,"вопросы":932,"дёрганья":933,"рассинхрона":934,"переходах":935,"a":936,"настройте":937,"длительность":938,"play":939,"затухания":940,"прерывается":941,"резко":942,"проверьте":943,"конфликтуют":944,"разных":945,"убедитесь":946,"настроен":947,"корректно":948,"скорость":949,"угол":950,"интенсивность":951,"дискретных":952,"последовательностей":953,"лучшая":954,"практика":955,"переключает":956,"режима":957,"правильно":958,"настроить":959,"маску":960,"верхней":961,"нижней":962,"части":963,"создайте":964,"отключите":965,"кости":966,"кроме":967,"торса":968,"головы":969,"назначьте":970,"второму":971,"базовый":972,"содержит":973,"должны":974,"полностью":975,"переопределены":976,"режим":977,"additive":978,"наложения":979,"конфликтов":980,"делает":981,"параметр":982,"отключать":983,"текущим":984,"кадром":985,"false":986,"хотите":987,"сохранить":988,"текущие":989,"предыдущей":990,"смешивании":991,"кастомных":992,"утилитах":993,"отладить":994,"проигрывается":995,"окно":996,"активен":997,"контроллер":998,"заблокирован":999,"условиями":1000,"совпадают":1001,"имена":1002,"аниматоре":1003,"иначе":1004,"сработает":1005,"масок":1006,"getlayerindex":1007,"setlayerweight":1008,"tween":1009,"dotween":1010,"место":1011,"подробного":1012,"разбора":1013,"spine":1014,"готовы":1015,"экспорт":1016,"https":1017,"www":1018,"youtube":1019,"com":1020,"watch":1021,"j0mgh4mvbgc":1022,"harmony":1023,"8fuyyg2ogi8":1024,"animationcontroller":1025,"используя":1026,"rigging":1027,"cy789ni2qxi":1028,"интеграция":1029,"dxdzttk2nle":1030,"бесплатный":1031,"тестовый":1032,"спайн":1033,"assetstore":1034,"packages":1035,"3d":1036,"animations":1037,"free":1038,"character":1039,"animation":1040,"177560":1041,"content":1042,"png":1043,"сета":1044,"hkaysu1z":1045,"n8":1046,"849s":1047,"dependency":1048,"injection":1049,"zenject":1050,"vcontainer":1051,"какая":1052,"чего":1053,"стандартном":1054,"scripting":1055,"framework":1056,"usf":1057,"зависимости":1058,"реализуются":1059,"сути":1060,"реализация":1061,"ecs":1062,"components":1063,"systems":1064,"данные":1065,"операции":1066,"monobehaviours":1067,"entity":1068,"сущность":1069,"id":1070,"gameobjects":1071,"том":1072,"дефолту":1073,"схеме":1074,"компонент":1075,"знает":1076,"других":1077,"сущностях":1078,"компонентах":1079,"е":1080,"своих":1081,"зависимостях":1082,"обеспечения":1083,"связей":1084,"ioc":1085,"container":1086,"inversion":1087,"of":1088,"control":1089,"создает":1090,"внедрены":1091,"приложения":1092,"di":1093,"архитектура":1094,"паттерн":1095,"которой":1096,"внедряет":1097,"другого":1098,"объекта":1099,"зависимость":1100,"нужен":1101,"классу":1102,"своего":1103,"внедрение":1104,"передача":1105,"зависимому":1106,"объекту":1107,"обеспечивать":1108,"свои":1109,"выполнять":1110,"другие":1111,"такие":1112,"injections":1113,"constructor":1114,"field":1115,"method":1116,"property":1117,"зависимостей":1118,"bindings":1119,"привязка":1120,"экземпляру":1121,"installers":1122,"предоставляют":1123,"ios":1124,"контейнеру":1125,"context":1126,"связывание":1127,"инсталлера":1128,"контейнера":1129,"иногда":1130,"делают":1131,"облегченные":1132,"версии":1133,"dicontainer":1134,"компенсировать":1135,"следующие":1136,"минусы":1137,"частое":1138,"system":1139,"reflection":1140,"runtime":1141,"рекомендуется":1142,"дороговизны":1143,"определенного":1144,"проектного":1145,"этого":1146,"тут":1147,"же":1148,"добавить":1149,"ивенты":1150,"контейнеров":1151,"внедрения":1152,"injectgameobject":1153,"проходит":1154,"всей":1155,"иерархии":1156,"доп":1157,"интерфейсы":1158,"огромен":1159,"функционала":1160,"никогда":1161,"пригождается":1162,"mvp":1163,"mvc":1164,"mvvm":1165,"geeksforgeeks":1166,"org":1167,"difference":1168,"between":1169,"and":1170,"architecture":1171,"pattern":1172,"android":1173,"model":1174,"view":1175,"модель":1176,"вид":1177,"представляет":1178,"реагирует":1179,"команды":1180,"изменяя":1181,"свое":1182,"отвечает":1183,"внешними":1184,"отображение":1185,"модели":1186,"реагируя":1187,"изменения":1188,"интерпретирует":1189,"действия":1190,"пользователя":1191,"оповещая":1192,"необходимости":1193,"изменений":1194,"он":1195,"обновляет":1196,"визуал":1197,"логика":1198,"ввод":1199,"обновление":1200,"связи":1201,"менее":1202,"изолированные":1203,"хуже":1204,"тестируемость":1205,"ui":1206,"presenter":1207,"представление":1208,"разница":1209,"имеет":1210,"прямой":1211,"эту":1212,"связь":1213,"обеспечивает":1214,"решает":1215,"отображать":1216,"контролируя":1217,"обрабатывает":1218,"обновляя":1219,"пассивна":1220,"подходит":1221,"unit":1222,"тестов":1223,"чёткая":1224,"структура":1225,"viewmodel":1226,"похож":1227,"нужные":1228,"представления":1229,"отделены":1230,"core":1231,"логики":1232,"абстракция":1233,"информирует":1234,"действиях":1235,"отображает":1236,"той":1237,"самостоятельной":1238,"имеющие":1239,"отношение":1240,"представлению":1241,"биндинги":1242,"связаны":1243,"binding":1244,"удобно":1245,"реактивностью":1246,"data":1247,"меньше":1248,"ручной":1249,"viper":1250,"interactor":1251,"бизнес":1252,"связывает":1253,"router":1254,"навигация":1255,"строго":1256,"изолированы":1257,"многоэкранных":1258,"сценариев":1259,"легко":1260,"масштабируется":1261,"тестируется":1262,"отличия":1263,"про":1264,"ничего":1265,"всю":1266,"логику":1267,"держит":1268,"изолирован":1269,"вынесены":1270,"отдельно":1271,"жестко":1272,"проблему":1273,"связуещего":1274,"звена":1275,"реализуется":1276,"событиями":1277,"сочетается":1278,"реактивным":1279,"программированием":1280,"гибким":1281,"отделение":1282,"ко":1283,"многим":1284,"реализован":1285,"разными":1286,"одному":1287,"одной":1288,"применены":1289,"разные":1290,"обрабатывается":1291,"сложно":1292,"тестировать":1293,"тестирование":1294,"осложняет":1295,"жесткая":1296,"легкое":1297,"счет":1298,"нежестких":1299,"выбрали":1300,"отделить":1301,"применения":1302,"разным":1303,"были":1304,"окна":1305,"инпутом":1306,"одинаковыми":1307,"входными":1308,"выходными":1309,"позволило":1310,"сделать":1311,"эдиторе":1312,"тестирования":1313,"solid":1314,"акроним":1315,"буква":1316,"принципов":1317,"ооп":1318,"s":1319,"single":1320,"responsibility":1321,"принцип":1322,"единственной":1323,"ответственности":1324,"какую":1325,"то":1326,"одну":1327,"функциональность":1328,"эта":1329,"должна":1330,"инкапсулирована":1331,"oped":1332,"closed":1333,"открытости":1334,"закрытости":1335,"открыты":1336,"расширения":1337,"закрыты":1338,"l":1339,"liskov":1340,"substitution":1341,"подстановки":1342,"барбары":1343,"лисков":1344,"наследник":1345,"дополняет":1346,"заменяет":1347,"могли":1348,"бы":1349,"использоваться":1350,"родительских":1351,"нарушая":1352,"программы":1353,"interface":1354,"segregation":1355,"разделения":1356,"интерфейсов":1357,"было":1358,"неиспользуемых":1359,"d":1360,"принци":1361,"инверсии":1362,"модули":1363,"верхних":1364,"уровней":1365,"зависеть":1366,"модулей":1367,"нижних":1368,"абстракции":1369,"конкретных":1370,"деталей":1371,"реализации":1372,"тогда":1373,"детали":1374,"абстракций":1375,"principle":1376,"примеры":1377,"отвечать":1378,"задачу":1379,"player":1380,"move":1381,"savetofile":1382,"игрок":1383,"одновременно":1384,"игровую":1385,"сохранение":1386,"savesystem":1387,"save":1388,"open":1389,"расширять":1390,"существующего":1391,"getdamage":1392,"weapon":1393,"sword":1394,"return":1395,"bow":1396,"нового":1397,"придется":1398,"менять":1399,"метод":1400,"iweapon":1401,"hammer":1402,"достаточно":1403,"создать":1404,"заменять":1405,"virtual":1406,"orc":1407,"override":1408,"attacks":1409,"любой":1410,"заменить":1411,"продолжит":1412,"работать":1413,"плохой":1414,"выбрасывает":1415,"notimplementedexception":1416,"ломает":1417,"контракт":1418,"класса":1419,"маленьких":1420,"огромный":1421,"icharacter":1422,"fly":1423,"пехотинец":1424,"умеет":1425,"летать":1426,"imovable":1427,"iattackable":1428,"iflyable":1429,"теперь":1430,"реализует":1431,"конкретной":1432,"audiomanager":1433,"_audio":1434,"привязан":1435,"iaudioservice":1436,"playsound":1437,"readonly":1438,"audio":1439,"принципы":1440,"лежат":1441,"объектно":1442,"ориентированного":1443,"программирования":1444,"полезны":1445,"решают":1446,"чём":1447,"абстракцией":1448,"инкапсуляцией":1449,"наследованием":1450,"полиморфизмом":1451,"опирается":1452,"четыре":1453,"базовых":1454,"принципа":1455,"инкапсуляция":1456,"наследование":1457,"полиморфизм":1458,"эти":1459,"строить":1460,"гибкие":1461,"переиспользуемые":1462,"расширяемые":1463,"архитектуры":1464,"помогают":1465,"упростить":1466,"скрыть":1467,"уменьшить":1468,"связанность":1469,"практике":1470,"существенных":1471,"характеристик":1472,"игнорирование":1473,"несущественных":1474,"определять":1475,"fire":1476,"раскрывая":1477,"конкретно":1478,"стреляют":1479,"виды":1480,"предоставив":1481,"простой":1482,"интерфейс":1483,"абстрактные":1484,"abstract":1485,"означает":1486,"сокрытие":1487,"внутреннего":1488,"доступом":1489,"нему":1490,"данным":1491,"публичные":1492,"свойства":1493,"поля":1494,"protected":1495,"модификаторов":1496,"доступа":1497,"internal":1498,"защитить":1499,"некорректного":1500,"описать":1501,"отношения":1502,"общими":1503,"частными":1504,"типами":1505,"производный":1506,"возможность":1507,"повторно":1508,"дублирования":1509,"поддерживается":1510,"одиночное":1511,"b":1512,"имитировать":1513,"множественное":1514,"объектам":1515,"одинаковым":1516,"интерфейсом":1517,"вести":1518,"себя":1519,"разному":1520,"возможно":1521,"счёт":1522,"переопределения":1523,"компилятор":1524,"рантайм":1525,"обрабатывать":1526,"тип":1527,"виртуальные":1528,"делегаты":1529,"каверзные":1530,"скрывает":1531,"простым":1532,"ограничивает":1533,"внутреннему":1534,"состоянию":1535,"реализовать":1536,"наследования":1537,"ienemy":1538,"классами":1539,"связанными":1540,"запрещено":1541,"проблем":1542,"ромбовидного":1543,"конфликта":1544,"альтернатива":1545,"композицию":1546,"отличается":1547,"содержать":1548,"реализацию":1549,"сигнатуры":1550,"множественно":1551,"абстрактный":1552,"_что":1553,"связан":1554,"_":1555,"подкласса":1556,"нарушение":1557,"неожиданному":1558,"поведению":1559,"использовании":1560,"интерфейса":1561,"свой":1562,"архитектурного":1563,"решения":1564,"опишите":1565,"вы":1566,"спроектировали":1567,"архитектуру":1568,"какого":1569,"либо":1570,"игрового":1571,"модуля":1572,"структурировать":1573,"систему":1574,"управления":1575,"игровыми":1576,"уровнями":1577,"инвентаря":1578,"мобильной":1579,"игре":1580,"здесь":1581,"оценивается":1582,"умение":1583,"разбивать":1584,"выделять":1585,"паттерны":1586,"проектирования":1587,"организации":1588,"todo":1589,"краткая":1590,"обобщающая":1591,"информация":1592,"теме":1593,"ответ":1594,"вопрос":1595,"глубокого":1596,"понимания":1597,"вопроса":1598,"задают":1599,"звездочкой":1600,"чистый":1601,"kiss":1602,"dry":1603,"yagni":1604,"keep":1605,"it":1606,"simple":1607,"stupid":1608,"усложнять":1609,"надежно":1610,"небольшие":1611,"решающие":1612,"лишнего":1613,"don":1614,"repeat":1615,"yourself":1616,"you":1617,"are":1618,"not":1619,"gonna":1620,"need":1621,"реализовывать":1622,"нужно":1623,"сейчас":1624,"ваши":1625,"небольшими":1626,"40":1627,"50":1628,"модификации":1629,"будущем":1630,"должно":1631,"возникнуть":1632,"трудностей":1633,"система":1634,"усложняется":1635,"надобности":1636,"устанавливайте":1637,"целую":1638,"библиотеку":1639,"ради":1640,"функции":1641,"неё":1642,"6":1643,"делай":1644,"просят":1645,"необходимо":1646,"дубово":1647,"копирования":1648,"выносите":1649,"общую":1650,"прежде":1651,"добавлять":1652,"функционал":1653,"проекте":1654,"создан":1655,"константы":1656,"реализуйте":1657,"теории":1658,"оно":1659,"пригодится":1660,"подчищайте":1661,"ненужный":1662,"найдите":1663,"git":1664,"историю":1665,"программист":1666,"котором":1667,"благими":1668,"намерениями":1669,"должной":1670,"добавите":1671,"багов":1672,"шаблоны":1673,"gof":1674,"grasp":1675,"game":1676,"programming":1677,"patterns":1678,"зачем":1679,"нужны":1680,"применяются":1681,"шаблонов":1682,"игровой":1683,"разработке":1684,"различия":1685,"паттернами":1686,"знать":1687,"наизусть":1688,"важнее":1689,"уметь":1690,"проверенные":1691,"временем":1692,"типовых":1693,"архитектурных":1694,"задач":1695,"gang":1696,"four":1697,"классические":1698,"23":1699,"штуки":1700,"разделенные":1701,"категории":1702,"порождающие":1703,"структурные":1704,"поведенческие":1705,"general":1706,"assignment":1707,"software":1708,"адаптация":1709,"задачи":1710,"геймдева":1711,"используют":1712,"комбинации":1713,"этих":1714,"подходов":1715,"адаптируя":1716,"особенности":1717,"движка":1718,"монобехи":1719,"сериализация":1720,"классических":1721,"шаблона":1722,"сформулированных":1723,"книге":1724,"_design":1725,"elements":1726,"reusable":1727,"oriented":1728,"software_":1729,"разделяются":1730,"категория":1731,"singleton":1732,"factory":1733,"builder":1734,"adapter":1735,"composite":1736,"decorator":1737,"observer":1738,"command":1739,"strategy":1740,"идея":1741,"снизить":1742,"гибкой":1743,"суть":1744,"information":1745,"expert":1746,"ответственность":1747,"у":1748,"кто":1749,"creator":1750,"им":1751,"владеет":1752,"использует":1753,"принимает":1754,"пользовательский":1755,"low":1756,"coupling":1757,"слабо":1758,"high":1759,"cohesion":1760,"polymorphism":1761,"делегирование":1762,"variations":1763,"закрыть":1764,"интерфейсами":1765,"абстракциями":1766,"основа":1767,"здравого":1768,"применяется":1769,"интуитивно":1770,"robert":1771,"nystrom":1772,"практичные":1773,"адаптированные":1774,"real":1775,"ограничение":1776,"движков":1777,"component":1778,"loop":1779,"jobsystem":1780,"event":1781,"queue":1782,"внутренние":1783,"decoupled":1784,"вызовы":1785,"ai":1786,"игровые":1787,"undo":1788,"buffer":1789,"репликация":1790,"service":1791,"locator":1792,"замена":1793,"instance":1794,"dirty":1795,"flag":1796,"пересчётов":1797,"флаг":1798,"изменении":1799,"подходы":1800,"конструкторы":1801,"сервисная":1802,"iuiservice":1803,"igamestateservice":1804,"геймплейной":1805,"чистых":1806,"модулях":1807,"применить":1808,"выбор":1809,"переключение":1810,"объединяются":1811,"стратегия":1812,"ограничений":1813,"проще":1814,"неявными":1815,"зло":1816,"нарушает":1817,"явность":1818,"усложняет":1819,"жизненным":1820,"циклом":1821,"сервис":1822,"локаторы":1823,"даже":1824,"принципу":1825,"_какой":1826,"сетевого":1827,"универсален":1828,"отложенного":1829,"отмены":1830,"реплеев":1831,"синхронизации":1832,"действий":1833,"ci":1834,"cd":1835,"cloud":1836,"jenkins":1837,"github":1838,"actions":1839,"организовать":1840,"проекта":1841,"наиболее":1842,"популярны":1843,"build":1844,"автоматизировать":1845,"сборки":1846,"юнитетсы":1847,"выкладку":1848,"билдов":1849,"автоматизирует":1850,"процессы":1851,"качества":1852,"выкладки":1853,"коробки":1854,"гибкость":1855,"gitlab":1856,"bitrise":1857,"инфраструктуры":1858,"уровня":1859,"кастомизации":1860,"бюджета":1861,"требуемой":1862,"прозрачности":1863,"автоматизируются":1864,"юнит":1865,"тесты":1866,"артефактов":1867,"деплой":1868,"testflight":1869,"google":1870,"s3":1871,"discord":1872,"облачный":1873,"встраивается":1874,"dashboard":1875,"простая":1876,"подключение":1877,"репозитория":1878,"целевой":1879,"платформы":1880,"автоматический":1881,"триггер":1882,"коммитов":1883,"multiple":1884,"targets":1885,"webgl":1886,"version":1887,"scm":1888,"credentials":1889,"automation":1890,"with":1891,"post":1892,"pre":1893,"export":1894,"methods":1895,"платный":1896,"большом":1897,"объеме":1898,"ограничена":1899,"скриптуемости":1900,"полной":1901,"shell":1902,"доступности":1903,"неудобно":1904,"пайплайнов":1905,"кроссплатформенный":1906,"сервер":1907,"кастомизацией":1908,"продвинутых":1909,"командах":1910,"контроль":1911,"инфраструктурой":1912,"основные":1913,"элементы":1914,"jenkinsfile":1915,"freestyle":1916,"job":1917,"cli":1918,"batchmode":1919,"nographics":1920,"executemethod":1921,"шаги":1922,"checkout":1923,"compile":1924,"tests":1925,"upload":1926,"установленный":1927,"editor":1928,"docker":1929,"контейнер":1930,"hub":1931,"activation":1932,"интегрируют":1933,"fastlane":1934,"artifactory":1935,"slack":1936,"нативный":1937,"лимита":1938,"удобной":1939,"yaml":1940,"конфигурацией":1941,"хорошей":1942,"интеграцией":1943,"pull":1944,"requests":1945,"issues":1946,"releases":1947,"образ":1948,"runner":1949,"поддерживаются":1950,"секреты":1951,"library":1952,"билда":1953,"apk":1954,"aab":1955,"zip":1956,"пуш":1957,"itch":1958,"io":1959,"firebase":1960,"hosting":1961,"советы":1962,"хардкодьте":1963,"platform":1964,"path":1965,"defines":1966,"buildconfig":1967,"отдельный":1968,"script":1969,"buildpipeline":1970,"buildplayer":1971,"ядро":1972,"храните":1973,"версию":1974,"одном":1975,"месте":1976,"cs":1977,"json":1978,"projectsettings":1979,"asset":1980,"отделяйте":1981,"скрипты":1982,"подключите":1983,"статический":1984,"всегда":1985,"артефакты":1986,"кэш":1987,"xcode":1988,"требует":1989,"подписания":1990,"какой":1991,"выбирать":1992,"устроен":1993,"командной":1994,"кешировать":1995,"_как":1996,"управлять":1997,"сборочными":1998,"конфигурациями":1999,"prod":2000,"dev":2001,"flow":2002,"отличаются":2003,"ветвления":2004,"trunk":2005,"based":2006,"ту":2007,"иную":2008,"стратегию":2009,"соглашения":2010,"веткам":2011,"коммитам":2012,"приняты":2013,"команде":2014,"распределённая":2015,"контроля":2016,"версий":2017,"позволяющая":2018,"каждому":2019,"участнику":2020,"полную":2021,"копию":2022,"стратегий":2023,"структурирующая":2024,"над":2025,"фичами":2026,"релизами":2027,"хотфиксами":2028,"команд":2029,"предсказуемым":2030,"релизов":2031,"избыточной":2032,"fast":2033,"paced":2034,"альтернативные":2035,"выбираются":2036,"процесса":2037,"qa":2038,"основы":2039,"dvcs":2040,"distributed":2041,"коммиты":2042,"ветки":2043,"мержи":2044,"локально":2045,"лишь":2046,"push":2047,"синхронизируются":2048,"удалённым":2049,"репозиторием":2050,"snapshot":2051,"коммит":2052,"ссылка":2053,"снимок":2054,"метаданные":2055,"автор":2056,"сообщение":2057,"родительский":2058,"мощную":2059,"поддержку":2060,"слияния":2061,"обеспечивая":2062,"быстрое":2063,"ветками":2064,"switch":2065,"независимую":2066,"разработку":2067,"feature":2068,"ветках":2069,"безопасные":2070,"эксперименты":2071,"stash":2072,"reflog":2073,"cherry":2074,"pick":2075,"rebase":2076,"лёгкое":2077,"восстановление":2078,"удалённых":2079,"стратегии":2080,"vincent":2081,"driessen":2082,"ориентирована":2083,"релизный":2084,"стабильная":2085,"прод":2086,"версия":2087,"релизы":2088,"develop":2089,"интеграционная":2090,"ветка":2091,"фичи":2092,"мержатся":2093,"сюда":2094,"мерж":2095,"release":2096,"подготовка":2097,"релизу":2098,"hotfix":2099,"экстренные":2100,"фиксы":2101,"преимущества":2102,"чёткое":2103,"удобство":2104,"предсказуемые":2105,"недостатки":2106,"веток":2107,"сложнее":2108,"визуально":2109,"мержить":2110,"continuous":2111,"deployment":2112,"development":2113,"используются":2114,"короткоживущие":2115,"branches":2116,"flags":2117,"плюсы":2118,"упрощённая":2119,"максимальная":2120,"совместимость":2121,"доставка":2122,"фич":2123,"высокой":2124,"дисциплины":2125,"покрытия":2126,"тестами":2127,"потенциально":2128,"параллельной":2129,"упрощённые":2130,"вариации":2131,"master":2132,"делаются":2133,"отдельных":2134,"проходят":2135,"request":2136,"вливаются":2137,"production":2138,"staging":2139,"окружений":2140,"проектов":2141,"артефактами":2142,"билды":2143,"meta":2144,"игнорировать":2145,"сгенерированные":2146,"файлы":2147,"gitignore":2148,"хранить":2149,"обязательны":2150,"guid":2151,"сценах":2152,"ассетах":2153,"конфликты":2154,"prefab":2155,"стоит":2156,"настраивать":2157,"smart":2158,"lock":2159,"plastic":2160,"командные":2161,"префиксы":2162,"bugfix":2163,"названия":2164,"movement":2165,"crash":2166,"сообщения":2167,"feat":2168,"добавлено":2169,"движение":2170,"fix":2171,"исправлен":2172,"баг":2173,"мержей":2174,"commit":2175,"триггеры":2176,"билд":2177,"сохраняет":2178,"объединения":2179,"переписывает":2180,"делая":2181,"её":2182,"линейной":2183,"опасен":2184,"публичных":2185,"чистки":2186,"истории":2187,"перед":2188,"неэффективен":2189,"изоляция":2190,"стабильность":2191,"избыточная":2192,"замедление":2193,"интеграции":2194,"использовали":2195,"мёрджа":2196,"убирает":2197,"необходимость":2198,"высоким":2199,"уровнем":2200,"автоматизации":2201,"squash":2202,"объединяет":2203,"сжатия":2204,"вливанием":2205,"чистоту":2206,"файлах":2207,"lfs":2208,"tool":2209,"редактирование":2210,"сцен":2211,"коммуникацию":2212,"блокировки":2213,"liveops":2214,"ab":2215,"testing":2216,"внутриигровые":2217,"предложения":2218,"сервисов":2219,"remote":2220,"config":2221,"gametune":2222,"gameanalytics":2223,"applovin":2224,"max":2225,"sdk":2226,"автотесты":2227,"test":2228,"dictionary":2229,"непрерывный":2230,"участок":2231,"фиксированной":2232,"длиной":2233,"неудобен":2234,"управлении":2235,"обёртка":2236,"массивом":2237,"динамической":2238,"аллокацией":2239,"эффективен":2240,"постепенном":2241,"tkey":2242,"tvalue":2243,"хеш":2244,"таблица":2245,"bucket":2246,"списками":2247,"ячейками":2248,"оптимален":2249,"быстрых":2250,"lookups":2251,"блок":2252,"header":2253,"length":2254,"внутренний":2255,"capacity":2256,"count":2257,"buckets":2258,"entries":2259,"key":2260,"hashcode":2261,"next":2262,"расположение":2263,"подряд":2264,"раскиданы":2265,"разбросаны":2266,"фрагментацией":2267,"адрес":2268,"base":2269,"sizeof":2270,"неприменимо":2271,"индексов":2272,"ключу":2273,"установка":2274,"прямая":2275,"ячейку":2276,"dict":2277,"значению":2278,"линейный":2279,"values":2280,"keys":2281,"перебором":2282,"среднем":2283,"коллизиях":2284,"вставка":2285,"конец":2286,"невозможна":2287,"амортизированно":2288,"соответствующий":2289,"удаление":2290,"сдвиг":2291,"удалённого":2292,"remove":2293,"вызывает":2294,"массива":2295,"известен":2296,"итерация":2297,"максимально":2298,"идут":2299,"чуть":2300,"медленнее":2301,"включать":2302,"пустые":2303,"удалённые":2304,"ячейки":2305,"реаллокация":2306,"превышении":2307,"resize":2308,"loadfactor":2309,"полного":2310,"перестроения":2311,"базовая":2312,"коллекция":2313,"представляющая":2314,"длины":2315,"непрерывной":2316,"производительных":2317,"операций":2318,"заранее":2319,"изменяется":2320,"внутреннее":2321,"устройство":2322,"располагаются":2323,"пропусков":2324,"называется":2325,"структурой":2326,"служебный":2327,"заголовок":2328,"длина":2329,"сами":2330,"последовательно":2331,"разрывов":2332,"отличная":2333,"локальность":2334,"рядом":2335,"логике":2336,"находятся":2337,"обращении":2338,"процессор":2339,"загрузит":2340,"остальные":2341,"подлежит":2342,"изменению":2343,"доступе":2344,"загружает":2345,"соседние":2346,"итерации":2347,"векторные":2348,"вычисления":2349,"быстрыми":2350,"фиксирован":2351,"создании":2352,"нельзя":2353,"изменить":2354,"вычисляется":2355,"структур":2356,"максимальную":2357,"плотность":2358,"динамический":2359,"универсальная":2360,"реализующая":2361,"обёртку":2362,"автоматическим":2363,"управлением":2364,"размером":2365,"предназначен":2366,"упорядоченных":2367,"возможностью":2368,"добавления":2369,"_items":2370,"хранилище":2371,"_size":2372,"реально":2373,"добавленных":2374,"выделенного":2375,"элемента":2376,"вместить":2377,"ступ":2378,"деаллокации":2379,"повторного":2380,"использовани":2381,"empty":2382,"первый":2383,"первую":2384,"аллокацию":2385,"переполнении":2386,"копированием":2387,"удвоенного":2388,"16":2389,"32":2390,"добавление":2391,"середине":2392,"сдвигом":2393,"известно":2394,"ожидаемое":2395,"сразу":2396,"указать":2397,"foo":2398,"избежит":2399,"каскада":2400,"копирований":2401,"списка":2402,"новых":2403,"trimexcess":2404,"уменьшает":2405,"пар":2406,"реализованная":2407,"массивами":2408,"оптимальна":2409,"поиска":2410,"вставки":2411,"количестве":2412,"пропускается":2413,"функцию":2414,"получается":2415,"целое":2416,"число":2417,"которому":2418,"определяется":2419,"ячейка":2420,"лежать":2421,"элемент":2422,"функция":2423,"gethashcode":2424,"определённый":2425,"ключа":2426,"получить":2427,"тот":2428,"коллизия":2429,"цепочка":2430,"индексы":2431,"потому":2432,"достижении":2433,"копируются":2434,"медленным":2435,"порядке":2436,"совпадающем":2437,"дыры":2438,"удалений":2439,"занимает":2440,"дополнительные":2441,"чтения":2442,"cpu":2443,"эффективно":2444,"предсказывать":2445,"адреса":2446,"высокая":2447,"equals":2448,"vector3int":2449,"unboxing":2450,"преобразования":2451,"значимого":2452,"значения":2453,"type":2454,"ссылочный":2455,"обратное":2456,"преобразование":2457,"обратно":2458,"потенциальное":2459,"падение":2460,"вызываемых":2461,"ongui":2462,"приводится":2463,"интерфейсу":2464,"кладётся":2465,"обёрнутую":2466,"оригинальное":2467,"извлечение":2468,"явного":2469,"приведения":2470,"копирует":2471,"неверен":2472,"будет":2473,"invalidcastexception":2474,"передаче":2475,"принимающий":2476,"логировании":2477,"pos":2478,"myvector3":2479,"добавлении":2480,"ienumerable":2481,"imyinterface":2482,"my":2483,"mystruct":2484,"аллоцируемая":2485,"убирать":2486,"статтеры":2487,"мобилках":2488,"незаметным":2489,"повторяться":2490,"каждую":2491,"frame":2492,"скрытые":2493,"toolkit":2494,"десятки":2495,"секунду":2496,"обобщения":2497,"generics":2498,"copyedit":2499,"valuetype":2500,"перфрейм":2501,"возможности":2502,"специальные":2503,"адаптеры":2504,"прочее":2505,"выделить":2506,"адаптер":2507,"generic":2508,"избегают":2509,"генерирует":2510,"метода":2511,"узнать":2512,"смотри":2513,"il":2514,"используй":2515,"профайлер":2516,"jetbrains":2517,"dottrace":2518,"отследить":2519,"spikes":2520,"unbox":2521,"ить":2522,"неверный":2523,"underlying":2524,"был":2525,"совместим":2526,"q6":2527,"точно":2528,"приведение":2529,"params":2530,"clr":2531,"jit":2532,"стандарт":2533,"построена":2534,"платформа":2535,"microsoft":2536,"компилируется":2537,"промежуточный":2538,"язык":2539,"запуска":2540,"преобразуется":2541,"компилятором":2542,"машинный":2543,"среды":2544,"common":2545,"language":2546,"infrastructure":2547,"спецификация":2548,"ecma":2549,"iso":2550,"описывающая":2551,"типовую":2552,"исполнения":2553,"безопасность":2554,"p":2555,"invoke":2556,"переносимые":2557,"исполняемые":2558,"mono":2559,"конкретная":2560,"выполнением":2561,"программ":2562,"компиляция":2563,"межъязыковая":2564,"запускает":2565,"intermediate":2566,"cil":2567,"байткод":2568,"языки":2569,"независим":2570,"скомпилирован":2571,"любую":2572,"just":2573,"берет":2574,"компилирует":2575,"конкретную":2576,"платформу":2577,"x64":2578,"учитывать":2579,"первом":2580,"вызове":2581,"включающая":2582,"библиотеки":2583,"bcl":2584,"компиляторы":2585,"roslyn":2586,"бывает":2587,"устарел":2588,"современное":2589,"компилировать":2590,"переносимый":2591,"формат":2592,"одинаково":2593,"понятный":2594,"платформ":2595,"облегчает":2596,"кроссплатформенность":2597,"преобразует":2598,"оптимизировать":2599,"обычный":2600,"il2cpp":2601,"проекты":2602,"компилируются":2603,"aot":2604,"запрещён":2605,"да":2606,"coreclr":2607,"ты":2608,"можешь":2609,"написать":2610,"свою":2611,"structures":2612,"myunity":2613,"d1":2614,"81":2615,"82":2616,"80":2617,"83":2618,"d0":2619,"ba":2620,"8b":2621,"b4":2622,"b0":2623,"bd":2624,"85":2625,"набор":2626,"идентифицируемых":2627,"организованных":2628,"lifo":2629,"last":2630,"first":2631,"out":2632,"последний":2633,"пришел":2634,"вышел":2635,"столбик":2636,"стопка":2637,"отложенные":2638,"пользователь":2639,"тапает":2640,"персонажу":2641,"занят":2642,"освободится":2643,"нам":2644,"важна":2645,"последнем":2646,"самом":2647,"актуальном":2648,"тапе":2649,"вершину":2650,"pop":2651,"вершины":2652,"peek":2653,"возвращение":2654,"очередь":2655,"fifo":2656,"начала":2657,"enqueue":2658,"dequeue":2659,"связный":2660,"узлов":2661,"хранятся":2662,"следующий":2663,"двусвязный":2664,"связанный":2665,"хранится":2666,"предыдущий":2667,"delegate":2668,"action":2669,"func":2670,"делегат":2671,"представляющий":2672,"определённой":2673,"сигнатурой":2674,"обобщённые":2675,"возвращает":2676,"активно":2677,"колбэков":2678,"асинхронных":2679,"загрузки":2680,"пр":2681,"чётко":2682,"сигнатуру":2683,"делегата":2684,"способный":2685,"соответствует":2686,"сигнатуре":2687,"аргументы":2688,"возвращаемое":2689,"damagehandler":2690,"amount":2691,"объявление":2692,"takedamage":2693,"dmg":2694,"hp":2695,"handler":2696,"мультикаст":2697,"объединять":2698,"будут":2699,"вызываться":2700,"очереди":2701,"сохраняется":2702,"последнего":2703,"вызванного":2704,"наличии":2705,"точной":2706,"аргумент":2707,"t1":2708,"t2":2709,"tresult":2710,"сначала":2711,"конце":2712,"повсеместно":2713,"button":2714,"onclick":2715,"addlistener":2716,"unityaction":2717,"multicastdelegate":2718,"oncomplete":2719,"onkill":2720,"onstepcomplete":2721,"tweencallback":2722,"ondamagetaken":2723,"custom":2724,"callbacks":2725,"dosomething":2726,"ondone":2727,"ссылочные":2728,"передавать":2729,"сравнивать":2730,"null":2731,"nullreferenceexception":2732,"проверяй":2733,"альтернативу":2734,"лямбде":2735,"collected":2736,"сам":2737,"держишь":2738,"мультикасте":2739,"возвращается":2740,"обработчика":2741,"vs":2742,"переменная":2743,"присвоить":2744,"очистить":2745,"возможен":2746,"изнутри":2747,"механизм":2748,"сигнал":2749,"событии":2750,"сигналов":2751,"onsomething":2752,"инвертированного":2753,"doafterdelay":2754,"callback":2755,"запрещающее":2756,"внешнее":2757,"присваивание":2758,"подписчиков":2759,"проверять":2760,"отписать":2761,"лямбду":2762,"лямбда":2763,"анонимная":2764,"неотписываема":2765,"игнорируются":2766,"порядку":2767,"отличный":2768,"плагиноподобных":2769,"систем":2770,"преимущество":2771,"обычным":2772,"методом":2773,"передать":2774,"повышает":2775,"модульность":2776,"enum":2777,"битовые":2778,"маски":2779,"применяют":2780,"обычного":2781,"подводные":2782,"камни":2783,"способ":2784,"именованные":2785,"представляющие":2786,"одного":2787,"сочетании":2788,"атрибутом":2789,"битовая":2790,"позволяя":2791,"комбинировать":2792,"множество":2793,"флагов":2794,"переменной":2795,"побитовые":2796,"системах":2797,"доступов":2798,"layermask":2799,"movementtype":2800,"капотом":2801,"целочисленные":2802,"фиксированного":2803,"набора":2804,"movementflags":2805,"none":2806,"0001":2807,"0010":2808,"0100":2809,"перечисления":2810,"биты":2811,"combined":2812,"0101":2813,"проверка":2814,"наличия":2815,"флага":2816,"степени":2817,"двойки":2818,"двоичном":2819,"представлении":2820,"уникальным":2821,"битом":2822,"произойдут":2823,"невозможно":2824,"понять":2825,"там":2826,"атрибут":2827,"влияет":2828,"добавляет":2829,"удобное":2830,"строковое":2831,"console":2832,"writeline":2833,"9":2834,"битовых":2835,"компактность":2836,"штук":2837,"long":2838,"64":2839,"hideflags":2840,"eventmodifiers":2841,"кастомные":2842,"системные":2843,"флаги":2844,"неиспользуемые":2845,"которого":2846,"вернёт":2847,"combinedvalue":2848,"еще":2849,"явно":2850,"задавать":2851,"пустого":2852,"масштабируются":2853,"рантайме":2854,"сериализует":2855,"выглядят":2856,"сериализовать":2857,"удобным":2858,"инспекторе":2859,"кастомный":2860,"propertydrawer":2861,"odin":2862,"битовый":2863,"layerindex":2864,"произойдет":2865,"задать":2866,"флагам":2867,"забыть":2868,"автоприсвоены":2869,"побитовая":2870,"сломается":2871,"начнут":2872,"конфликтовать":2873,"debuggerdisplay":2874,"нечитабельны":2875,"обязателен":2876,"желателен":2877,"проверяет":2878,"точное":2879,"совпадение":2880,"битов":2881,"установлен":2882,"флагом":2883,"флагами":2884,"битовыми":2885,"чекбоксами":2886,"аналогами":2887,"языках":2888,"встречается":2889,"rust":2890,"swift":2891,"наличие":2892,"аналогов":2893,"конкретного":2894,"языка":2895,"очищаются":2896,"удаляются":2897,"поколениям":2898,"gen":2899,"запускается":2900,"мере":2901,"нехватке":2902,"приостанавливать":2903,"выполнение":2904,"потока":2905,"pause":2906,"встроенный":2907,"виртуальной":2908,"машины":2909,"отвечающий":2910,"автоматическое":2911,"сборках":2912,"backend":2913,"boehm":2914,"сгенерированный":2915,"признак":2916,"значимый":2917,"очистка":2918,"reference":2919,"types":2920,"момент":2921,"строит":2922,"достижимости":2923,"корневых":2924,"статические":2925,"регистры":2926,"помечает":2927,"дотянуться":2928,"считаются":2929,"мусором":2930,"удалены":2931,"фаз":2932,"mark":2933,"находит":2934,"достижимые":2935,"sweep":2936,"удаляет":2937,"мусорные":2938,"compact":2939,"перемещает":2940,"выжившие":2941,"устранить":2942,"фрагментацию":2943,"поколения":2944,"разделяет":2945,"поколение":2946,"описание":2947,"частая":2948,"пережившие":2949,"промежуточная":2950,"зона":2951,"долго":2952,"живущие":2953,"редкая":2954,"тяжёлая":2955,"loh":2956,"large":2957,"кб":2958,"перемещаются":2959,"чистятся":2960,"выживший":2961,"продвигается":2962,"тем":2963,"определённым":2964,"условиям":2965,"хватает":2966,"свободной":2967,"превысило":2968,"лимит":2969,"allocation":2970,"budget":2971,"выросло":2972,"прямом":2973,"остановка":2974,"визуальные":2975,"сборку":2976,"крайней":2977,"паузу":2978,"блокировку":2979,"адаптивного":2980,"финализаторами":2981,"tools":2982,"бенчмарков":2983,"точек":2984,"явной":2985,"финализаторы":2986,"idisposable":2987,"подход":2988,"финализатор":2989,"classname":2990,"вызывается":2991,"удалением":2992,"увеличивает":2993,"нагрузку":2994,"отложенное":2995,"dispose":2996,"контролируемый":2997,"быстрый":2998,"финализации":2999,"освобождения":3000,"неуправляемых":3001,"ресурсов":3002,"хендлы":3003,"практики":3004,"полезно":3005,"избегает":3006,"кадре":3007,"снижает":3008,"частоту":3009,"pool":3010,"готовые":3011,"destroy":3012,"очищает":3013,"новой":3014,"лишние":3015,"финализатора":3016,"освобождение":3017,"задержек":3018,"профайлеры":3019,"устранять":3020,"избыточные":3021,"скрытых":3022,"enumerator":3023,"лямбды":3024,"выделением":3025,"полезные":3026,"кадровые":3027,"retained":3028,"objects":3029,"дерево":3030,"дубликаты":3031,"gettotalmemory":3032,"текущий":3033,"объектом":3034,"пока":3035,"удалён":3036,"идёт":3037,"финализаторов":3038,"вызываются":3039,"задержкой":3040,"блокируют":3041,"увеличивают":3042,"приведении":3043,"упакуется":3044,"выделенный":3045,"мешает":3046,"внутренней":3047,"редко":3048,"выигрыш":3049,"q7":3050,"выживает":3051,"нескольких":3052,"проходов":3053,"считается":3054,"долгоживущим":3055,"переносится":3056,"следующее":3057,"описывает":3058,"допускает":3059,"множественную":3060,"свойств":3061,"индексаторов":3062,"возможна":3063,"default":3064,"полей":3065,"описания":3066,"независимо":3067,"члены":3068,"реализованные":3069,"наследуется":3070,"общей":3071,"частичной":3072,"обобщённого":3073,"наследовать":3074,"этом":3075,"ireloadable":3076,"reload":3077,"gun":3078,"требований":3079,"структуре":3080,"индексаторы":3081,"реализующий":3082,"абстрактным":3083,"классом":3084,"неоднозначностей":3085,"множественным":3086,"методами":3087,"явная":3088,"ifoo":3089,"do":3090,"ibar":3091,"предоставить":3092,"базовую":3093,"выдаст":3094,"ошибку":3095,"объявлен":3096,"базовом":3097,"классе":3098,"hashset":3099,"linkedlist":3100,"устроены":3101,"коллекции":3102,"реализуют":3103,"обычные":3104,"совместимы":3105,"burst":3106,"характеру":3107,"уникальности":3108,"уникальность":3109,"совместима":3110,"jobs":3111,"кольцевой":3112,"буфер":3113,"конца":3114,"узлу":3115,"извлекает":3116,"очередей":3117,"пула":3118,"q":3119,"item":3120,"простых":3121,"реальном":3122,"времени":3123,"кольцевые":3124,"nativequeue":3125,"кладёт":3126,"сверху":3127,"снимает":3128,"алгоритмах":3129,"обхода":3130,"dfs":3131,"откатов":3132,"second":3133,"val":3134,"полезен":3135,"back":3136,"меню":3137,"внимания":3138,"аллокациям":3139,"linkedlistnode":3140,"списков":3141,"частыми":3142,"удалениями":3143,"вставками":3144,"ссылке":3145,"node":3146,"addlast":3147,"addafter":3148,"15":3149,"зрения":3150,"кэша":3151,"уникальных":3152,"благодаря":3153,"pathfinding":3154,"кэшах":3155,"set":3156,"contains":3157,"отлично":3158,"фильтрации":3159,"дубликатов":3160,"главное":3161,"помнить":3162,"горячих":3163,"путях":3164,"iequatable":3165,"выбрать":3166,"задача":3167,"рекомендуемая":3168,"redo":3169,"фильтрация":3170,"высоконагруженный":3171,"реальный":3172,"геймплей":3173,"кастомная":3174,"collections":3175,"применим":3176,"unmanaged":3177,"собственную":3178,"кольцевого":3179,"буфера":3180,"пустой":3181,"бросится":3182,"исключение":3183,"invalidoperationexception":3184,"_почему":3185,"хотя":3186,"тоже":3187,"addfirst":3188,"removefirst":3189,"массивах":3190,"узел":3191,"неизменяемый":3192,"immutable":3193,"фактически":3194,"синоним":3195,"любая":3196,"буферизированный":3197,"изменяемый":3198,"эффективной":3199,"лишних":3200,"format":3201,"интерполяции":3202,"ключевое":3203,"слово":3204,"взаимозаменяемы":3205,"sealed":3206,"char":3207,"icomparable":3208,"др":3209,"операторы":3210,"substring":3211,"replace":3212,"split":3213,"toupper":3214,"интернируются":3215,"abc":3216,"ссылаться":3217,"дизайну":3218,"безопасности":3219,"упрощения":3220,"хэширования":3221,"кеширования":3222,"предсказуемость":3223,"изменяемыми":3224,"строку":3225,"могла":3226,"повлиять":3227,"другую":3228,"immutability":3229,"исключает":3230,"side":3231,"effects":3232,"поскольку":3233,"изменяются":3234,